RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_clock.c
/******************************************************************************
 ***************************** Support Functions*******************************
 *****************************************************************************/

static cy_rslt_t _cyhal_clock_compute_div(uint64_t input_hz, uint32_t desired_hz, uint32_t divider_bits, const cyhal_clock_tolerance_t *tolerance, uint32_t *div)
{
    uint32_t max_div = (1 << divider_bits);
    *div = (input_hz + (desired_hz / 2)) / desired_hz;
    if (*div > max_div)
        *div = max_div;

    uint32_t diff = (tolerance != NULL)
        ? (uint32_t)abs(_cyhal_utils_calculate_tolerance(tolerance->type, desired_hz, input_hz / *div))
        : 0;

    return ((tolerance != NULL) && (diff > tolerance->value))
        ? CYHAL_CLOCK_RSLT_ERR_FREQ
        : CY_RSLT_SUCCESS;
}

static uint32_t _cyhal_clock_get_lf_frequency(void)
{
    cy_en_clklf_in_sources_t source = Cy_SysClk_ClkLfGetSource();
    switch (source)
    {
        case CY_SYSCLK_CLKLF_IN_ILO:
#if defined(COMPONENT_CAT1C)
        case CY_SYSCLK_CLKLF_IN_ILO1:
#endif
            return CY_SYSCLK_ILO_FREQ;
#if _CYHAL_SRSS_PILO_PRESENT
        case CY_SYSCLK_CLKLF_IN_PILO:
            return CY_SYSCLK_PILO_FREQ;
#endif
#if SRSS_BACKUP_PRESENT
        case CY_SYSCLK_CLKLF_IN_WCO:
            return CY_SYSCLK_WCO_FREQ;
#endif
#if SRSS_ALTLF_PRESENT
        case CY_SYSCLK_CLKLF_IN_ALTLF:
            return Cy_SysClk_AltLfGetFrequency();
#endif
#if defined(COMPONENT_CAT1B)
#if SRSS_ECO_PRESENT
        case CY_SYSCLK_CLKLF_IN_ECO_PRESCALER:
            //return Cy_SysClk_EcoPrescalerGetFrequency();
            return 0;
#endif
#if SRSS_BACKUP_S40E_LPECO_PRESENT
        case CY_SYSCLK_CLKLF_IN_LPECO_PRESCALER:
            return Cy_SysClk_LpEcoPrescalerGetFrequency();
#endif
#endif
        default:
            CY_ASSERT(false);
            return 0;
    }
}

static void _cyhal_clock_update_system_state(bool before_change, uint32_t old_sysclk_freq_hz, uint32_t new_sysclk_freq_hz)
{
    // If increasing the clock frequency we need to update the speeds
    // before the change. If decreasing the frequency we need to update
    // after the change.
    if ((before_change == (bool)(new_sysclk_freq_hz > old_sysclk_freq_hz)) ||
        (!before_change == (new_sysclk_freq_hz < old_sysclk_freq_hz)))
    {
#if defined(COMPONENT_CAT1A)
        bool is_ulp = Cy_SysPm_IsSystemUlp();
// TODO: CAT1D to be confirmed here
#elif defined(COMPONENT_CAT1B) || defined(COMPONENT_CAT1D)
        bool is_ulp = true;
#elif defined(COMPONENT_CAT1C)
        bool is_ulp = false;
#endif
        Cy_SysLib_SetWaitStates(is_ulp, new_sysclk_freq_hz / 1000000);
    }

    // If after the change, update the clock
    if (!before_change)
        SystemCoreClockUpdate();
}


static cy_rslt_t _cyhal_clock_set_enabled_unsupported(cyhal_clock_t *clock, bool enabled, bool wait_for_lock)
{
    CY_UNUSED_PARAMETER(clock);
    CY_UNUSED_PARAMETER(enabled);
    CY_UNUSED_PARAMETER(wait_for_lock);
    CY_ASSERT(false); // Unhandled clock
    return CYHAL_CLOCK_RSLT_ERR_NOT_SUPPORTED;
}
static cy_rslt_t _cyhal_clock_set_frequency_unsupported(cyhal_clock_t *clock, uint32_t hz, const cyhal_clock_tolerance_t *tolerance)
{
    CY_UNUSED_PARAMETER(clock);
    CY_UNUSED_PARAMETER(hz);
    CY_UNUSED_PARAMETER(tolerance);
    CY_ASSERT(false); // Unhandled clock
    return CYHAL_CLOCK_RSLT_ERR_NOT_SUPPORTED;
}
static cy_rslt_t _cyhal_clock_set_divider_unsupported(cyhal_clock_t *clock, uint32_t divider)
{
    CY_UNUSED_PARAMETER(clock);
    CY_UNUSED_PARAMETER(divider);
    CY_ASSERT(false); // Unhandled clock
    return CYHAL_CLOCK_RSLT_ERR_NOT_SUPPORTED;
}
static cy_rslt_t _cyhal_clock_set_source_unsupported(cyhal_clock_t *clock, const cyhal_clock_t *source)
{
    CY_UNUSED_PARAMETER(clock);
    CY_UNUSED_PARAMETER(source);
    CY_ASSERT(false); // Unhandled clock
    return CYHAL_CLOCK_RSLT_ERR_NOT_SUPPORTED;
}
static bool _cyhal_clock_is_enabled_true(const cyhal_clock_t *clock)
{
    CY_UNUSED_PARAMETER(clock);
    return true;
}
static cy_rslt_t _cyhal_clock_get_sources_none(const cyhal_clock_t *clock, const cyhal_resource_inst_t **sources[], uint32_t *count)
{
    CY_UNUSED_PARAMETER(clock);
    CY_UNUSED_PARAMETER(sources);
    *count = 0;
    return CY_RSLT_SUCCESS;
}


static const cyhal_resource_inst_t *_CYHAL_CLOCK_SOURCE_HF[] =
{
#if defined(COMPONENT_CAT1A) || defined(COMPONENT_CAT1C) || (SRSS_FLL_PRESENT)
    &CYHAL_CLOCK_RSC_FLL,
#endif
#if defined(COMPONENT_CAT1A)
#if (_CYHAL_SRSS_NUM_PLL > 0)
    &CYHAL_CLOCK_RSC_PLL[0],
#endif
#if (_CYHAL_SRSS_NUM_PLL > 1)
    &CYHAL_CLOCK_RSC_PLL[1],
#endif
#if (_CYHAL_SRSS_NUM_PLL > 2)
    &CYHAL_CLOCK_RSC_PLL[2],
#endif
#if (_CYHAL_SRSS_NUM_PLL > 3)
    &CYHAL_CLOCK_RSC_PLL[3],
#endif
#if (_CYHAL_SRSS_NUM_PLL > 4)
    &CYHAL_CLOCK_RSC_PLL[4],
#endif
#if (_CYHAL_SRSS_NUM_PLL > 5)
    &CYHAL_CLOCK_RSC_PLL[5],
#endif
#if (_CYHAL_SRSS_NUM_PLL > 6)
    &CYHAL_CLOCK_RSC_PLL[6],
#endif
#if (_CYHAL_SRSS_NUM_PLL > 7)
    &CYHAL_CLOCK_RSC_PLL[7],
#endif
#if (_CYHAL_SRSS_NUM_PLL > 8)
    &CYHAL_CLOCK_RSC_PLL[8],
#endif
#if (_CYHAL_SRSS_NUM_PLL > 9)
    &CYHAL_CLOCK_RSC_PLL[9],
#endif
#if (_CYHAL_SRSS_NUM_PLL > 10)
    &CYHAL_CLOCK_RSC_PLL[10],
#endif
#if (_CYHAL_SRSS_NUM_PLL > 11)
    &CYHAL_CLOCK_RSC_PLL[11],
#endif
#if (_CYHAL_SRSS_NUM_PLL > 12)
    &CYHAL_CLOCK_RSC_PLL[12],
#endif
#if (_CYHAL_SRSS_NUM_PLL > 13)
    &CYHAL_CLOCK_RSC_PLL[13],
#endif
#elif defined(COMPONENT_CAT1C)
#if (SRSS_NUM_PLL200M > 0)
    &CYHAL_CLOCK_RSC_PLL200M[0],
#endif
#if (SRSS_NUM_PLL200M > 1)
    &CYHAL_CLOCK_RSC_PLL200M[1],
#endif
#if (SRSS_NUM_PLL200M > 2)
    &CYHAL_CLOCK_RSC_PLL200M[2],
#endif
#if (SRSS_NUM_PLL200M > 3)
    &CYHAL_CLOCK_RSC_PLL200M[3],
#endif
#if (SRSS_NUM_PLL200M > 4)
    &CYHAL_CLOCK_RSC_PLL200M[4],
#endif
#if (SRSS_NUM_PLL200M > 5)
    &CYHAL_CLOCK_RSC_PLL200M[5],
#endif
#if (SRSS_NUM_PLL200M > 6)
    &CYHAL_CLOCK_RSC_PLL200M[6],
#endif
#if (SRSS_NUM_PLL200M > 7)
    &CYHAL_CLOCK_RSC_PLL200M[7],
#endif
#if (SRSS_NUM_PLL200M > 8)
    &CYHAL_CLOCK_RSC_PLL200M[8],
#endif
#if (SRSS_NUM_PLL200M > 9)
    &CYHAL_CLOCK_RSC_PLL200M[9],
#endif
#if (SRSS_NUM_PLL200M > 10)
    &CYHAL_CLOCK_RSC_PLL200M[10],
#endif
#if (SRSS_NUM_PLL200M > 11)
    &CYHAL_CLOCK_RSC_PLL200M[11],
#endif
#if (SRSS_NUM_PLL200M > 12)
    &CYHAL_CLOCK_RSC_PLL200M[12],
#endif
#if (SRSS_NUM_PLL200M > 13)
    &CYHAL_CLOCK_RSC_PLL200M[13],
#endif
#if (SRSS_NUM_PLL200M > 14)
    &CYHAL_CLOCK_RSC_PLL200M[14],
#endif
#if (SRSS_NUM_PLL200M > 14)
    &CYHAL_CLOCK_RSC_PLL200M[14],
#endif
#if (SRSS_NUM_PLL400M > 0)
    &CYHAL_CLOCK_RSC_PLL400M[0],
#endif
#if (SRSS_NUM_PLL400M > 1)
    &CYHAL_CLOCK_RSC_PLL400M[1],
#endif
#if (SRSS_NUM_PLL400M > 2)
    &CYHAL_CLOCK_RSC_PLL400M[2],
#endif
#if (SRSS_NUM_PLL400M > 3)
    &CYHAL_CLOCK_RSC_PLL400M[3],
#endif
#if (SRSS_NUM_PLL400M > 4)
    &CYHAL_CLOCK_RSC_PLL400M[4],
#endif
#if (SRSS_NUM_PLL400M > 5)
    &CYHAL_CLOCK_RSC_PLL400M[5],
#endif
#if (SRSS_NUM_PLL400M > 6)
    &CYHAL_CLOCK_RSC_PLL400M[6],
#endif
#if (SRSS_NUM_PLL400M > 7)
    &CYHAL_CLOCK_RSC_PLL400M[7],
#endif
#if (SRSS_NUM_PLL400M > 8)
    &CYHAL_CLOCK_RSC_PLL400M[8],
#endif
#if (SRSS_NUM_PLL400M > 9)
    &CYHAL_CLOCK_RSC_PLL400M[9],
#endif
#if (SRSS_NUM_PLL400M > 10)
    &CYHAL_CLOCK_RSC_PLL400M[10],
#endif
#if (SRSS_NUM_PLL400M > 11)
    &CYHAL_CLOCK_RSC_PLL400M[11],
#endif
#if (SRSS_NUM_PLL400M > 12)
    &CYHAL_CLOCK_RSC_PLL400M[12],
#endif
#if (SRSS_NUM_PLL400M > 13)
    &CYHAL_CLOCK_RSC_PLL400M[13],
#endif
#if (SRSS_NUM_PLL400M > 14)
    &CYHAL_CLOCK_RSC_PLL400M[14],
#endif
#if (SRSS_NUM_PLL400M > 14)
    &CYHAL_CLOCK_RSC_PLL400M[14],
#endif
#endif
    &CYHAL_CLOCK_RSC_PATHMUX[0],
#if (SRSS_NUM_CLKPATH > 1)
    &CYHAL_CLOCK_RSC_PATHMUX[1],
#endif
#if (SRSS_NUM_CLKPATH > 2)
    &CYHAL_CLOCK_RSC_PATHMUX[2],
#endif
#if (SRSS_NUM_CLKPATH > 3)
    &CYHAL_CLOCK_RSC_PATHMUX[3],
#endif
#if (SRSS_NUM_CLKPATH > 4)
    &CYHAL_CLOCK_RSC_PATHMUX[4],
#endif
#if (SRSS_NUM_CLKPATH > 5)
    &CYHAL_CLOCK_RSC_PATHMUX[5],
#endif
#if (SRSS_NUM_CLKPATH > 6)
    &CYHAL_CLOCK_RSC_PATHMUX[6],
#endif
#if (SRSS_NUM_CLKPATH > 7)
    &CYHAL_CLOCK_RSC_PATHMUX[7],
#endif
#if (SRSS_NUM_CLKPATH > 8)
    &CYHAL_CLOCK_RSC_PATHMUX[8],
#endif
#if (SRSS_NUM_CLKPATH > 9)
    &CYHAL_CLOCK_RSC_PATHMUX[9],
#endif
#if (SRSS_NUM_CLKPATH > 10)
    &CYHAL_CLOCK_RSC_PATHMUX[10],
#endif
#if (SRSS_NUM_CLKPATH > 11)
    &CYHAL_CLOCK_RSC_PATHMUX[11],
#endif
#if (SRSS_NUM_CLKPATH > 12)
    &CYHAL_CLOCK_RSC_PATHMUX[12],
#endif
#if (SRSS_NUM_CLKPATH > 13)
    &CYHAL_CLOCK_RSC_PATHMUX[13],
#endif
#if (SRSS_NUM_CLKPATH > 14)
    &CYHAL_CLOCK_RSC_PATHMUX[14],
#endif
#if (SRSS_NUM_CLKPATH > 15)
    &CYHAL_CLOCK_RSC_PATHMUX[15],
#endif
};

