RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_clock.c
// TODO: CAT1D to be confirmed here
#if defined (COMPONENT_CAT1B) || defined(COMPONENT_CAT1C) || defined(COMPONENT_CAT1D)
static cy_rslt_t _cyhal_clock_get_sources_peri_peripheral(uint8_t idx, const cyhal_resource_inst_t **sources[], uint32_t *count)
{
    static const cyhal_resource_inst_t *_CYHAL_CLOCK_SOURCE_PERI[SRSS_NUM_HFROOT] =
    {
        &CYHAL_CLOCK_RSC_HF[0],
    #if (SRSS_NUM_HFROOT > 1)
        &CYHAL_CLOCK_RSC_HF[1],
    #endif
    #if (SRSS_NUM_HFROOT > 2)
        &CYHAL_CLOCK_RSC_HF[2],
    #endif
    #if (SRSS_NUM_HFROOT > 3)
        &CYHAL_CLOCK_RSC_HF[3],
    #endif
    #if (SRSS_NUM_HFROOT > 4)
        &CYHAL_CLOCK_RSC_HF[4],
    #endif
    #if (SRSS_NUM_HFROOT > 5)
        &CYHAL_CLOCK_RSC_HF[5],
    #endif
    #if (SRSS_NUM_HFROOT > 6)
        &CYHAL_CLOCK_RSC_HF[6],
    #endif
    #if (SRSS_NUM_HFROOT > 7)
        &CYHAL_CLOCK_RSC_HF[7],
    #endif
    #if (SRSS_NUM_HFROOT > 8)
        &CYHAL_CLOCK_RSC_HF[8],
    #endif
    #if (SRSS_NUM_HFROOT > 9)
        &CYHAL_CLOCK_RSC_HF[9],
    #endif
    #if (SRSS_NUM_HFROOT > 10)
        &CYHAL_CLOCK_RSC_HF[10],
    #endif
    #if (SRSS_NUM_HFROOT > 11)
        &CYHAL_CLOCK_RSC_HF[11],
    #endif
    #if (SRSS_NUM_HFROOT > 12)
        &CYHAL_CLOCK_RSC_HF[12],
    #endif
    #if (SRSS_NUM_HFROOT > 13)
        &CYHAL_CLOCK_RSC_HF[13],
    #endif
    #if (SRSS_NUM_HFROOT > 14)
        &CYHAL_CLOCK_RSC_HF[14],
    #endif
    #if (SRSS_NUM_HFROOT > 15)
        &CYHAL_CLOCK_RSC_HF[15],
    #endif
    };

    *sources = &(_CYHAL_CLOCK_SOURCE_PERI[idx]);
    *count = 1;
    return CY_RSLT_SUCCESS;
}
#endif


// IMO
static uint32_t _cyhal_clock_get_frequency_imo(const cyhal_clock_t *clock)
{
    CY_UNUSED_PARAMETER(clock);
    return CY_SYSCLK_IMO_FREQ;
}


// ECO
#if SRSS_ECO_PRESENT
static bool _cyhal_clock_is_enabled_eco(const cyhal_clock_t *clock)
{
    CY_UNUSED_PARAMETER(clock);
    return 0u != (SRSS_CLK_ECO_CONFIG & SRSS_CLK_ECO_CONFIG_ECO_EN_Msk);
}
static cy_rslt_t _cyhal_clock_set_enabled_eco(cyhal_clock_t *clock, bool enabled, bool wait_for_lock)
{
    CY_UNUSED_PARAMETER(clock);

    #if !defined(COMPONENT_CAT1D) /* TODO Re-enable when the PDL is updated */
    if (enabled)
    {
        if (0u != (SRSS_CLK_ECO_CONFIG & SRSS_CLK_ECO_CONFIG_ECO_EN_Msk))
        {
            // Already enabled
            if (wait_for_lock)
            {
                for (int t = 0; t < 3 && Cy_SysClk_EcoGetStatus() != CY_SYSCLK_ECOSTAT_STABLE; ++t)
                {
                    cyhal_system_delay_us(1000UL);
                }
                return Cy_SysClk_EcoGetStatus() == CY_SYSCLK_ECOSTAT_STABLE
                    ? CY_RSLT_SUCCESS
                    : CY_SYSCLK_TIMEOUT;
            }
            return CY_RSLT_SUCCESS;
        }
        else
        {
            return Cy_SysClk_EcoEnable(wait_for_lock ? 3000UL : 0UL);
        }
    }
    else
    {
        Cy_SysClk_EcoDisable();
        return CY_RSLT_SUCCESS;
    }
    #else
        CY_UNUSED_PARAMETER(enabled);
        CY_UNUSED_PARAMETER(wait_for_lock);
        return CYHAL_CLOCK_RSLT_ERR_NOT_SUPPORTED;
    #endif
}
static uint32_t _cyhal_clock_get_frequency_eco(const cyhal_clock_t *clock)
{
    CY_UNUSED_PARAMETER(clock);
    #if !defined(COMPONENT_CAT1D) /* TODO Re-enable when the PDL is updated */
    return Cy_SysClk_EcoGetFrequency();
    #else
    return 0u;
    #endif
}
#endif

// EXT
static bool _cyhal_clock_is_enabled_ext(const cyhal_clock_t *clock)
{
    CY_UNUSED_PARAMETER(clock);
    return (Cy_SysClk_ExtClkGetFrequency() > 0);
}
static uint32_t _cyhal_clock_get_frequency_ext(const cyhal_clock_t *clock)
{
    CY_UNUSED_PARAMETER(clock);
    return Cy_SysClk_ExtClkGetFrequency();
}
static cy_rslt_t _cyhal_clock_set_frequency_ext(cyhal_clock_t *clock, uint32_t hz, const cyhal_clock_tolerance_t *tolerance)
{
    CY_UNUSED_PARAMETER(clock);
    CY_UNUSED_PARAMETER(tolerance);

    Cy_SysClk_ExtClkSetFrequency(hz);
    return CY_RSLT_SUCCESS;
}

// ALTHF
#if SRSS_ALTHF_PRESENT
static bool _cyhal_clock_is_enabled_althf(const cyhal_clock_t *clock)
{
    CY_UNUSED_PARAMETER(clock);
    return (Cy_SysClk_AltHfGetFrequency() > 0);
}
static uint32_t _cyhal_clock_get_frequency_althf(const cyhal_clock_t *clock)
{
    CY_UNUSED_PARAMETER(clock);
    return Cy_SysClk_AltHfGetFrequency();
}
#endif

// ALTLF
#if SRSS_ALTLF_PRESENT
static bool _cyhal_clock_is_enabled_altlf(const cyhal_clock_t *clock)
{
    CY_UNUSED_PARAMETER(clock);
    return Cy_SysClk_AltLfIsEnabled();
}
static uint32_t _cyhal_clock_get_frequency_altlf(const cyhal_clock_t *clock)
{
    CY_UNUSED_PARAMETER(clock);
    return Cy_SysClk_AltLfGetFrequency();
}
#endif

// IHO
#if defined(COMPONENT_CAT1B)
static bool _cyhal_clock_is_enabled_iho(const cyhal_clock_t *clock)
{
    CY_UNUSED_PARAMETER(clock);
    return Cy_SysClk_IhoIsEnabled();
}
static cy_rslt_t _cyhal_clock_set_enabled_iho(cyhal_clock_t *clock, bool enabled, bool wait_for_lock)
{
    CY_UNUSED_PARAMETER(clock);
    CY_UNUSED_PARAMETER(wait_for_lock);

    if (enabled)
        Cy_SysClk_IhoEnable();
    else
        Cy_SysClk_IhoDisable();
    return CY_RSLT_SUCCESS;
}
static uint32_t _cyhal_clock_get_frequency_iho(const cyhal_clock_t *clock)
{
    CY_UNUSED_PARAMETER(clock);
    return CY_SYSCLK_IHO_FREQ;
}
#endif

// ILO
static bool _cyhal_clock_is_enabled_ilo(const cyhal_clock_t *clock)
{
    CY_UNUSED_PARAMETER(clock);
    #if defined(COMPONENT_CAT1C)
    return Cy_SysClk_IloSrcIsEnabled(clock->channel);
    #else
    return Cy_SysClk_IloIsEnabled();
    #endif
}
static cy_rslt_t _cyhal_clock_set_enabled_ilo(cyhal_clock_t *clock, bool enabled, bool wait_for_lock)
{
    CY_UNUSED_PARAMETER(clock);
    CY_UNUSED_PARAMETER(wait_for_lock);
    #if defined(COMPONENT_CAT1C)
    if (enabled)
    {
        Cy_SysPm_BgRefCtrl(true);
        Cy_WDT_Unlock();
        Cy_SysClk_IloSrcEnable(clock->channel);
        Cy_WDT_Lock();
    }
    else
    {
        Cy_SysPm_BgRefCtrl(false);
        Cy_WDT_Unlock();
        Cy_SysClk_IloSrcDisable(clock->channel);
        Cy_WDT_Lock();
    }
    #else
    if (enabled)
        Cy_SysClk_IloEnable();
    else
        Cy_SysClk_IloDisable();
    #endif
    return CY_RSLT_SUCCESS;
}
static uint32_t _cyhal_clock_get_frequency_ilo(const cyhal_clock_t *clock)
{
    CY_UNUSED_PARAMETER(clock);
    return CY_SYSCLK_ILO_FREQ;
}

// PILO
#if _CYHAL_SRSS_PILO_PRESENT
static bool _cyhal_clock_is_enabled_pilo(const cyhal_clock_t *clock)
{
    CY_UNUSED_PARAMETER(clock);
    return Cy_SysClk_PiloIsEnabled();
}
static cy_rslt_t _cyhal_clock_set_enabled_pilo(cyhal_clock_t *clock, bool enabled, bool wait_for_lock)
{
    CY_UNUSED_PARAMETER(clock);
    CY_UNUSED_PARAMETER(wait_for_lock);

