RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_clock.c
    if (enabled)
        Cy_SysClk_PiloEnable();
    else
        Cy_SysClk_PiloDisable();
    return CY_RSLT_SUCCESS;
}
static uint32_t _cyhal_clock_get_frequency_pilo(const cyhal_clock_t *clock)
{
    CY_UNUSED_PARAMETER(clock);
    return CY_SYSCLK_PILO_FREQ;
}
#endif

// WCO
#if SRSS_BACKUP_PRESENT
static bool _cyhal_clock_is_enabled_wco(const cyhal_clock_t *clock)
{
    CY_UNUSED_PARAMETER(clock);
#if defined(CY_IP_MXS28SRSS)
    return 0u != (BACKUP_CTL & BACKUP_WCO_CTL_WCO_EN_Msk);
#else
    return 0u != (BACKUP_CTL & BACKUP_CTL_WCO_EN_Msk);
#endif
}
static cy_rslt_t _cyhal_clock_set_enabled_wco(cyhal_clock_t *clock, bool enabled, bool wait_for_lock)
{
    CY_UNUSED_PARAMETER(clock);

    if (enabled)
    {
        cy_rslt_t rslt = Cy_SysClk_WcoEnable(wait_for_lock ? 1000000UL : 0UL);
        // Ignore CY_SYSCLK_TIMEOUT unless wait_for_lock is true
        return wait_for_lock ? rslt : CY_RSLT_SUCCESS;
    }
    else
    {
        Cy_SysClk_WcoDisable();
        return CY_RSLT_SUCCESS;
    }
}
static uint32_t _cyhal_clock_get_frequency_wco(const cyhal_clock_t *clock)
{
    CY_UNUSED_PARAMETER(clock);
    return CY_SYSCLK_WCO_FREQ;
}
#endif

// MFO
#if defined(COMPONENT_CAT1B) || (SRSS_MFO_PRESENT)
static bool _cyhal_clock_is_enabled_mfo(const cyhal_clock_t *clock)
{
    CY_UNUSED_PARAMETER(clock);
    return Cy_SysClk_MfoIsEnabled();
}
static cy_rslt_t _cyhal_clock_set_enabled_mfo(cyhal_clock_t *clock, bool enabled, bool wait_for_lock)
{
    CY_UNUSED_PARAMETER(clock);
    CY_UNUSED_PARAMETER(wait_for_lock);

    if (enabled)
        Cy_SysClk_MfoEnable(true);
    else
        Cy_SysClk_MfoDisable();
    return CY_RSLT_SUCCESS;
}
static uint32_t _cyhal_clock_get_frequency_mfo(const cyhal_clock_t *clock)
{
    CY_UNUSED_PARAMETER(clock);
    return CY_SYSCLK_MFO_FREQ;
}
static cy_rslt_t _cyhal_clock_get_sources_mfo(const cyhal_clock_t *clock, const cyhal_resource_inst_t **sources[], uint32_t *count)
{
    CY_UNUSED_PARAMETER(clock);

    static const cyhal_resource_inst_t *_CYHAL_CLOCK_SOURCE_MFO[] =
    {
        &CYHAL_CLOCK_RSC_IMO,
    };

    *sources = _CYHAL_CLOCK_SOURCE_MFO;
    *count = sizeof(_CYHAL_CLOCK_SOURCE_MFO) / sizeof(_CYHAL_CLOCK_SOURCE_MFO[0]);
    return CY_RSLT_SUCCESS;
}
#endif

// PathMux
static uint32_t _cyhal_clock_get_frequency_pathmux(const cyhal_clock_t *clock)
{
    return Cy_SysClk_ClkPathMuxGetFrequency(clock->channel);
}
static cy_rslt_t _cyhal_clock_get_sources_pathmux(const cyhal_clock_t *clock, const cyhal_resource_inst_t **sources[], uint32_t *count)
{
    CY_UNUSED_PARAMETER(clock);

    static const cyhal_resource_inst_t *_CYHAL_CLOCK_SOURCE_PATHMUX[] =
    {
        &CYHAL_CLOCK_RSC_IMO,
    #if defined(COMPONENT_CAT1B)
        &CYHAL_CLOCK_RSC_IHO,
    #endif
    #if SRSS_ECO_PRESENT
        &CYHAL_CLOCK_RSC_ECO,
    #endif
        &CYHAL_CLOCK_RSC_EXT,
    #if SRSS_ALTHF_PRESENT
        &CYHAL_CLOCK_RSC_ALTHF,
    #endif
    #if defined(COMPONENT_CAT1C)
        &CYHAL_CLOCK_RSC_ILO[0],
        #if (SRSS_HT_VARIANT > 0)
        &CYHAL_CLOCK_RSC_ILO[1],
        #endif
    // TODO: To be fixed for CAT1D
    #elif !defined(COMPONENT_CAT1D)
        &CYHAL_CLOCK_RSC_ILO,
    #endif
    #if _CYHAL_SRSS_PILO_PRESENT
        &CYHAL_CLOCK_RSC_PILO,
    #endif
    #if SRSS_BACKUP_PRESENT
        &CYHAL_CLOCK_RSC_WCO,
    #endif
    #if SRSS_ALTLF_PRESENT
        &CYHAL_CLOCK_RSC_ALTLF,
    #endif
    };

    *sources = _CYHAL_CLOCK_SOURCE_PATHMUX;
    *count = sizeof(_CYHAL_CLOCK_SOURCE_PATHMUX) / sizeof(_CYHAL_CLOCK_SOURCE_PATHMUX[0]);
    return CY_RSLT_SUCCESS;
}
static cy_rslt_t _cyhal_clock_set_source_pathmux(cyhal_clock_t *clock, const cyhal_clock_t *source)
{
    uint32_t new_freq;
    cy_en_clkpath_in_sources_t clkpath_src;
    switch (source->block)
    {
        case CYHAL_CLOCK_BLOCK_IMO:
            clkpath_src = CY_SYSCLK_CLKPATH_IN_IMO;
            new_freq = CY_SYSCLK_IMO_FREQ;
            break;
#if defined(COMPONENT_CAT1B)
        case CYHAL_CLOCK_BLOCK_IHO:
            clkpath_src = CY_SYSCLK_CLKPATH_IN_IHO;
            new_freq = CY_SYSCLK_IHO_FREQ;
            break;
#endif
        case CYHAL_CLOCK_BLOCK_EXT:
            clkpath_src = CY_SYSCLK_CLKPATH_IN_EXT;
            new_freq = Cy_SysClk_ExtClkGetFrequency();
            break;
#if SRSS_ECO_PRESENT && !defined(COMPONENT_CAT1D) /* TODO Re-enable when the PDL is updated */
        case CYHAL_CLOCK_BLOCK_ECO:
            clkpath_src = CY_SYSCLK_CLKPATH_IN_ECO;
            new_freq = Cy_SysClk_EcoGetFrequency();
            break;
#endif
#if SRSS_ALTHF_PRESENT
        case CYHAL_CLOCK_BLOCK_ALTHF:
            clkpath_src = CY_SYSCLK_CLKPATH_IN_ALTHF;
            new_freq = Cy_SysClk_AltHfGetFrequency();
            break;
#endif
        case CYHAL_CLOCK_BLOCK_ILO:
        #if defined(COMPONENT_CAT1C)
            if (1 == source->channel)
            {
                clkpath_src = CY_SYSCLK_CLKPATH_IN_ILO1;
                new_freq = CY_SYSCLK_ILO_FREQ;
            }
            else
        #endif
            {
                clkpath_src = CY_SYSCLK_CLKPATH_IN_ILO;
                new_freq = CY_SYSCLK_ILO_FREQ;
            }
            break;
#if SRSS_BACKUP_PRESENT
        case CYHAL_CLOCK_BLOCK_WCO:
            clkpath_src = CY_SYSCLK_CLKPATH_IN_WCO;
            new_freq = CY_SYSCLK_WCO_FREQ;
            break;
#endif
#if SRSS_ALTLF_PRESENT
        case CYHAL_CLOCK_BLOCK_ALTLF:
            clkpath_src = CY_SYSCLK_CLKPATH_IN_ALTLF;
            new_freq = Cy_SysClk_AltLfGetFrequency();
            break;
#endif
#if _CYHAL_SRSS_PILO_PRESENT
        case CYHAL_CLOCK_BLOCK_PILO:
            clkpath_src = CY_SYSCLK_CLKPATH_IN_PILO;
            new_freq = CY_SYSCLK_PILO_FREQ;
            break;
#endif
        default:
            CY_ASSERT(false); //Unhandled clock
            return CYHAL_CLOCK_RSLT_ERR_SOURCE;
    }

    uint32_t old_hf_freq = Cy_SysClk_ClkHfGetFrequency(0);
    uint32_t new_hf_freq = new_freq >> ((uint8_t)Cy_SysClk_ClkHfGetDivider(0));
    bool is_sysclk_path = (clock->channel == (uint32_t)Cy_SysClk_ClkHfGetSource(0));

    if (is_sysclk_path)
        _cyhal_clock_update_system_state(true, old_hf_freq, new_hf_freq);

    cy_rslt_t rslt = Cy_SysClk_ClkPathSetSource(clock->channel, clkpath_src);

    if (is_sysclk_path)
    {
        if (CY_RSLT_SUCCESS == rslt)
            _cyhal_clock_update_system_state(false, old_hf_freq, new_hf_freq);
        else // revert the change if there was one
            _cyhal_clock_update_system_state(false, new_hf_freq, old_hf_freq);
    }

    return rslt;
}


// FLL
#if defined(COMPONENT_CAT1A) || defined(COMPONENT_CAT1C) || (SRSS_FLL_PRESENT)
static bool _cyhal_clock_is_enabled_fll(const cyhal_clock_t *clock)
{
    CY_UNUSED_PARAMETER(clock);
    return Cy_SysClk_FllIsEnabled();
}
static cy_rslt_t _cyhal_clock_set_enabled_fll(cyhal_clock_t *clock, bool enabled, bool wait_for_lock)
{
    CY_UNUSED_PARAMETER(clock);
    CY_UNUSED_PARAMETER(wait_for_lock);

    cy_stc_fll_manual_config_t cfg;
    Cy_SysClk_FllGetConfiguration(&cfg);
    uint32_t new_freq, old_freq;
    uint32_t div = (uint32_t)Cy_SysClk_ClkHfGetDivider(0);
    uint32_t src_freq = Cy_SysClk_ClkPathMuxGetFrequency(0);
    uint32_t fll_freq = CY_SYSLIB_DIV_ROUND((uint64_t)src_freq * (uint64_t)cfg.fllMult, (uint32_t)cfg.refDiv * ((cfg.enableOutputDiv) ? 2UL : 1UL));
    if (enabled)
    {
        new_freq = fll_freq >> div;
        old_freq = src_freq >> div;
    }
    else
    {
        new_freq = src_freq >> div;
        old_freq = fll_freq >> div;
    }

