RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_clock.c
            if (enabled)
            {
                cy_rslt_t rslt2 = Cy_SysClk_PllEnable(pll_idx, _CYHAL_CLOCK_PLL_LOCK_TIME);
                if (CY_RSLT_SUCCESS == rslt)
                    rslt = rslt2;
            }

            if (pll_sources_hf0)
            {
                if (CY_RSLT_SUCCESS == rslt)
                    _cyhal_clock_update_system_state(false, old_hf_freq, new_hf_freq);
                else // revert the change if there was one
                    _cyhal_clock_update_system_state(false, new_hf_freq, old_hf_freq);
            }
        }
    }

    return rslt;
}
static cy_rslt_t _cyhal_clock_get_sources_pll(const cyhal_clock_t *clock, const cyhal_resource_inst_t **sources[], uint32_t *count)
{
    // _CYHAL_CLOCK_SOURCE_HF has entries for FLL, PLL[n], PathMux[m]
#if defined(COMPONENT_CAT1A) || defined(COMPONENT_CAT1C) || (SRSS_FLL_PRESENT)
    #if defined(COMPONENT_CAT1C)
    uint8_t channel = clock->channel;
    if (clock->block == CYHAL_CLOCK_BLOCK_PLL200)
    {
        channel = channel + SRSS_NUM_PLL400M;
    }
    *sources = &(_CYHAL_CLOCK_SOURCE_HF[2 + _CYHAL_SRSS_NUM_PLL + channel]);
    #endif
    *sources = &(_CYHAL_CLOCK_SOURCE_HF[2 + _CYHAL_SRSS_NUM_PLL + clock->channel]); /* PATHMUX[n] entry is after the FLL (+1), PLLs (+num) and FLL path mux (+1) */
#else
    *sources = &(_CYHAL_CLOCK_SOURCE_HF[_CYHAL_SRSS_NUM_PLL + clock->channel]); /* PATHMUX[n] entry is after the PLLs (+num) */
#endif
    *count = 1;
    return CY_RSLT_SUCCESS;
}
#endif

// MF
#if defined(COMPONENT_CAT1B) || (SRSS_MFO_PRESENT)
static bool _cyhal_clock_is_enabled_mf(const cyhal_clock_t *clock)
{
    CY_UNUSED_PARAMETER(clock);
    return Cy_SysClk_ClkMfIsEnabled();
}
static cy_rslt_t _cyhal_clock_set_enabled_mf(cyhal_clock_t *clock, bool enabled, bool wait_for_lock)
{
    CY_UNUSED_PARAMETER(clock);
    CY_UNUSED_PARAMETER(wait_for_lock);

    if (enabled)
        Cy_SysClk_ClkMfEnable();
    else
        Cy_SysClk_ClkMfDisable();
    return CY_RSLT_SUCCESS;
}
static uint32_t _cyhal_clock_get_frequency_mf(const cyhal_clock_t *clock)
{
    CY_UNUSED_PARAMETER(clock);
    return Cy_SysClk_ClkMfGetFrequency();
}
static cy_rslt_t _cyhal_clock_set_frequency_mf(cyhal_clock_t *clock, uint32_t hz, const cyhal_clock_tolerance_t *tolerance)
{
    CY_UNUSED_PARAMETER(clock);

    uint32_t div;
    cy_rslt_t rslt = _cyhal_clock_compute_div(CY_SYSCLK_MFO_FREQ, hz, 8, tolerance, &div);

    if(false == CY_SYSCLK_IS_MF_DIVIDER_VALID(div))
        rslt = CYHAL_CLOCK_RSLT_ERR_FREQ;

    if (CY_RSLT_SUCCESS == rslt)
        Cy_SysClk_ClkMfSetDivider(div);

    return rslt;
}
static cy_rslt_t _cyhal_clock_set_divider_mf(cyhal_clock_t *clock, uint32_t divider)
{
    CY_UNUSED_PARAMETER(clock);

    if (divider <= 256)
    {
        Cy_SysClk_ClkMfSetDivider(divider);
        return CY_RSLT_SUCCESS;
    }
    return CYHAL_CLOCK_RSLT_ERR_FREQ;
}
static cy_rslt_t _cyhal_clock_get_sources_mf(const cyhal_clock_t *clock, const cyhal_resource_inst_t **sources[], uint32_t *count)
{
    CY_UNUSED_PARAMETER(clock);

    static const cyhal_resource_inst_t *_CYHAL_CLOCK_SOURCE_MF[] =
    {
        &CYHAL_CLOCK_RSC_MFO,
    #if defined(COMPONENT_CAT1B) /* CAT1A only supports driving from the MFO */
        &CYHAL_CLOCK_RSC_ILO,
    #if SRSS_BACKUP_PRESENT
        &CYHAL_CLOCK_RSC_WCO,
    #endif
    #if _CYHAL_SRSS_PILO_PRESENT
        &CYHAL_CLOCK_RSC_PILO,
    #endif
    #if SRSS_ALTLF_PRESENT
        &CYHAL_CLOCK_RSC_ALTLF,
    #endif
    #if SRSS_ECO_PRESENT
        &CYHAL_CLOCK_RSC_ECO_PRESCALER,
    #endif
    #if SRSS_BACKUP_S40E_LPECO_PRESENT
        &CYHAL_CLOCK_RSC_LPECO_PRESCALER,
    #endif
    #endif /* defined(COMPONENT_CAT1B) */
    };

    *sources = _CYHAL_CLOCK_SOURCE_MF;
    *count = sizeof(_CYHAL_CLOCK_SOURCE_MF) / sizeof(_CYHAL_CLOCK_SOURCE_MF[0]);
    return CY_RSLT_SUCCESS;
}
static cy_rslt_t _cyhal_clock_set_source_mf(cyhal_clock_t *clock, const cyhal_clock_t *source)
{
    CY_UNUSED_PARAMETER(clock);

    switch(source->block)
    {
        case CYHAL_CLOCK_BLOCK_MFO:
            Cy_SysClk_ClkMfSetSource(CY_SYSCLK_CLKMF_IN_MFO);
            return CY_RSLT_SUCCESS;
        case CYHAL_CLOCK_BLOCK_ILO:
            Cy_SysClk_ClkMfSetSource(CY_SYSCLK_CLKMF_IN_ILO);
            return CY_RSLT_SUCCESS;
#if SRSS_BACKUP_PRESENT
        case CYHAL_CLOCK_BLOCK_WCO:
            Cy_SysClk_ClkMfSetSource(CY_SYSCLK_CLKMF_IN_WCO);
            return CY_RSLT_SUCCESS;
#endif
#if _CYHAL_SRSS_PILO_PRESENT
        case CYHAL_CLOCK_BLOCK_PILO:
            Cy_SysClk_ClkMfSetSource(CY_SYSCLK_CLKMF_IN_PILO);
            return CY_RSLT_SUCCESS;
#endif
#if SRSS_ALTLF_PRESENT
        case CYHAL_CLOCK_BLOCK_ALTLF:
            Cy_SysClk_ClkMfSetSource(CY_SYSCLK_CLKMF_IN_ALTLF);
            return CY_RSLT_SUCCESS;
#endif
#if SRSS_ECO_PRESENT
        case CYHAL_CLOCK_BLOCK_ECO_PRESCALER:
            Cy_SysClk_ClkMfSetSource(CY_SYSCLK_CLKMF_IN_ECO_PRESCALER);
            return CY_RSLT_SUCCESS;
#endif
#if SRSS_BACKUP_S40E_LPECO_PRESENT
        case CYHAL_CLOCK_BLOCK_LPECO_PRESCALER:
            Cy_SysClk_ClkMfSetSource(CY_SYSCLK_CLKMF_IN_LPECO);
            return CY_RSLT_SUCCESS;
#endif
        default:
            CY_ASSERT(false); //Unhandled clock
            return CYHAL_CLOCK_RSLT_ERR_SOURCE;
    }
}
#endif

// HF
static bool _cyhal_clock_is_enabled_hf(const cyhal_clock_t *clock)
{
    return Cy_SysClk_ClkHfIsEnabled(clock->channel);
}
static cy_rslt_t _cyhal_clock_set_enabled_hf(cyhal_clock_t *clock, bool enabled, bool wait_for_lock)
{
    CY_UNUSED_PARAMETER(wait_for_lock);

    return (enabled)
        ? Cy_SysClk_ClkHfEnable(clock->channel)
        : Cy_SysClk_ClkHfDisable(clock->channel);
}
static uint32_t _cyhal_clock_get_frequency_hf(const cyhal_clock_t *clock)
{
    return Cy_SysClk_ClkHfGetFrequency(clock->channel);
}
static cy_rslt_t _cyhal_clock_set_divider_hf(cyhal_clock_t *clock, uint32_t divider)
{
    cy_en_clkhf_dividers_t new_div;
    switch (divider)
    {
        case 1:
            new_div = CY_SYSCLK_CLKHF_NO_DIVIDE;
            break;
        case 2:
            new_div = CY_SYSCLK_CLKHF_DIVIDE_BY_2;
            break;
        case 4:
            new_div = CY_SYSCLK_CLKHF_DIVIDE_BY_4;
            break;
        case 8:
            new_div = CY_SYSCLK_CLKHF_DIVIDE_BY_8;
            break;
        default:
            return CYHAL_CLOCK_RSLT_ERR_FREQ;
    }

    /* Only used if updating HFClk 0 */
    uint32_t old_div = (uint32_t)Cy_SysClk_ClkHfGetDivider(0);
    uint32_t src = (uint32_t)Cy_SysClk_ClkHfGetSource(0);
    uint32_t path_freq = Cy_SysClk_ClkPathGetFrequency(src);
    uint32_t old_freq = path_freq >> old_div;
    uint32_t new_freq = path_freq >> ((uint32_t)new_div);

