RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_clock.c
    if (0 == clock->channel)
        _cyhal_clock_update_system_state(true, old_freq, new_freq);

    cy_rslt_t rslt = (cy_rslt_t)Cy_SysClk_ClkHfSetDivider(clock->channel, new_div);

    if (0 == clock->channel)
    {
        if (CY_RSLT_SUCCESS == rslt)
            _cyhal_clock_update_system_state(false, old_freq, new_freq);
        else // revert the change if there was one
            _cyhal_clock_update_system_state(false, new_freq, old_freq);
    }

    return rslt;
}
static cy_rslt_t _cyhal_clock_get_sources_hf(const cyhal_clock_t *clock, const cyhal_resource_inst_t **sources[], uint32_t *count)
{
    CY_UNUSED_PARAMETER(clock);
    *sources = _CYHAL_CLOCK_SOURCE_HF;
    *count = sizeof(_CYHAL_CLOCK_SOURCE_HF) / sizeof(_CYHAL_CLOCK_SOURCE_HF[0]);
    return CY_RSLT_SUCCESS;
}
static cy_rslt_t _cyhal_clock_set_source_hf(cyhal_clock_t *clock, const cyhal_clock_t *source)
{
    uint32_t new_src;
    if (source->block == CYHAL_CLOCK_BLOCK_PATHMUX || source->block == CYHAL_CLOCK_BLOCK_FLL)
        new_src = source->channel;
#if defined(COMPONENT_CAT1A)
    else if (source->block == CYHAL_CLOCK_BLOCK_PLL)
// TODO: CAT1D to be confirmed here
#elif defined(COMPONENT_CAT1B) || defined(COMPONENT_CAT1C) || defined(COMPONENT_CAT1D)
    else if ((source->block == CYHAL_CLOCK_BLOCK_PLL200) || (source->block == CYHAL_CLOCK_BLOCK_PLL400))
#endif
    {
        new_src = source->channel + 1;
#if defined(SRSS_NUM_PLL400M) && (defined(COMPONENT_CAT1B) || defined(COMPONENT_CAT1C) || defined(COMPONENT_CAT1D))
        if (source->block == CYHAL_CLOCK_BLOCK_PLL200)
        {
            /* As PLL200 and PLL400 has their own channels and PLL400 sits on lower PATH_MUX numbers
             * we need to increase calculated source num with respect to number of PLL400's */
            new_src += SRSS_NUM_PLL400M;
        }
#endif /* defined(COMPONENT_CAT1B) || defined(COMPONENT_CAT1C) || defined(COMPONENT_CAT1D) */
    }
    else
        return CYHAL_CLOCK_RSLT_ERR_SOURCE;

    /* Only used if updating HFClk 0 */
    uint32_t div_hf0 = (uint32_t)Cy_SysClk_ClkHfGetDivider(0);
    uint32_t old_src_hf0 = (uint32_t)Cy_SysClk_ClkHfGetSource(0);
    uint32_t old_freq_hf0 = Cy_SysClk_ClkPathGetFrequency(old_src_hf0) >> div_hf0;
    uint32_t new_freq_hf0 = Cy_SysClk_ClkPathGetFrequency(new_src) >> div_hf0;

    if (0 == clock->channel)
        _cyhal_clock_update_system_state(true, old_freq_hf0, new_freq_hf0);

    cy_rslt_t rslt = Cy_SysClk_ClkHfSetSource(clock->channel, (cy_en_clkhf_in_sources_t)new_src);

    if (0 == clock->channel)
    {
        if (CY_RSLT_SUCCESS == rslt)
            _cyhal_clock_update_system_state(false, old_freq_hf0, new_freq_hf0);
        else // revert the change if there was one
            _cyhal_clock_update_system_state(false, new_freq_hf0, old_freq_hf0);
    }

    return rslt;
}

// LF
static uint32_t _cyhal_clock_get_frequency_lf(const cyhal_clock_t *clock)
{
    CY_UNUSED_PARAMETER(clock);
    return _cyhal_clock_get_lf_frequency();
}
static cy_rslt_t _cyhal_clock_get_sources_lf(const cyhal_clock_t *clock, const cyhal_resource_inst_t **sources[], uint32_t *count)
{
    CY_UNUSED_PARAMETER(clock);

    static const cyhal_resource_inst_t *_CYHAL_CLOCK_SOURCE_LF[] =
    {
    #if defined(COMPONENT_CAT1C)
        &CYHAL_CLOCK_RSC_ILO[0],
        #if (SRSS_HT_VARIANT > 0)
        &CYHAL_CLOCK_RSC_ILO[1],
        #endif
    // TODO: To be fixed for CAT1D
    #elif !defined(COMPONENT_CAT1D)
        &CYHAL_CLOCK_RSC_ILO,
    #endif
    #if _CYHAL_SRSS_PILO_PRESENT
        &CYHAL_CLOCK_RSC_PILO,
    #endif
    #if SRSS_BACKUP_PRESENT
        &CYHAL_CLOCK_RSC_WCO,
    #endif
    #if SRSS_ALTLF_PRESENT
        &CYHAL_CLOCK_RSC_ALTLF,
    #endif
#if defined(COMPONENT_CAT1B)
#if SRSS_ECO_PRESENT
        &CYHAL_CLOCK_RSC_ECO_PRESCALER,
#endif
#if SRSS_BACKUP_S40E_LPECO_PRESENT
        &CYHAL_CLOCK_RSC_LPECO_PRESCALER,
#endif
#endif
    };

    *sources = _CYHAL_CLOCK_SOURCE_LF;
    *count = sizeof(_CYHAL_CLOCK_SOURCE_LF) / sizeof(_CYHAL_CLOCK_SOURCE_LF[0]);
    return CY_RSLT_SUCCESS;
}
static cy_rslt_t _cyhal_clock_set_source_lf(cyhal_clock_t *clock, const cyhal_clock_t *source)
{
    CY_UNUSED_PARAMETER(clock);
    cy_rslt_t result = CY_RSLT_SUCCESS;
    #if defined(COMPONENT_CAT1C)
    Cy_WDT_Unlock();
    #endif
    switch (source->block)
    {
        case CYHAL_CLOCK_BLOCK_ILO:
        #if defined(COMPONENT_CAT1C)
            if(1 == source->channel)
            {
                Cy_SysClk_ClkLfSetSource(CY_SYSCLK_CLKLF_IN_ILO1);
            }
            else
        #endif
            {
                Cy_SysClk_ClkLfSetSource(CY_SYSCLK_CLKLF_IN_ILO);
            }
            break;
#if SRSS_BACKUP_PRESENT
        case CYHAL_CLOCK_BLOCK_WCO:
            Cy_SysClk_ClkLfSetSource(CY_SYSCLK_CLKLF_IN_WCO);
            break;
#endif
#if SRSS_ALTLF_PRESENT
        case CYHAL_CLOCK_BLOCK_ALTLF:
            Cy_SysClk_ClkLfSetSource(CY_SYSCLK_CLKLF_IN_ALTLF);
            break;
#endif
#if _CYHAL_SRSS_PILO_PRESENT
        case CYHAL_CLOCK_BLOCK_PILO:
            Cy_SysClk_ClkLfSetSource(CY_SYSCLK_CLKLF_IN_PILO);
            break;
#endif
#if defined(COMPONENT_CAT1B)
#if SRSS_ECO_PRESENT
        case CYHAL_CLOCK_BLOCK_ECO_PRESCALER:
            Cy_SysClk_ClkLfSetSource(CY_SYSCLK_CLKLF_IN_ECO_PRESCALER);
            break;
#endif
#if SRSS_BACKUP_S40E_LPECO_PRESENT
        case CYHAL_CLOCK_BLOCK_LPECO_PRESCALER:
            Cy_SysClk_ClkLfSetSource(CY_SYSCLK_CLKLF_IN_LPECO_PRESCALER);
            break;
#endif
#endif
        default:
            CY_ASSERT(false); //Unhandled clock
            result = CYHAL_CLOCK_RSLT_ERR_SOURCE;
    }
    #if defined(COMPONENT_CAT1C)
    Cy_WDT_Lock();
    #endif
    return result;
}

#if defined(COMPONENT_CAT1A) || defined(COMPONENT_CAT1C)
// FAST
static uint32_t _cyhal_clock_get_frequency_fast(const cyhal_clock_t *clock)
{
    CY_UNUSED_PARAMETER(clock);
    #if defined(COMPONENT_CAT1A)
    return Cy_SysClk_ClkFastGetFrequency();
    #else
    return Cy_SysClk_ClkFastSrcGetFrequency(clock->channel);
    #endif
}
static cy_rslt_t _cyhal_clock_set_frequency_fast(cyhal_clock_t *clock, uint32_t hz, const cyhal_clock_tolerance_t *tolerance)
{
    CY_UNUSED_PARAMETER(clock);

    uint32_t div;
    cy_rslt_t rslt;
    #if defined(COMPONENT_CAT1A)
    uint64_t input_hz = (uint64_t)Cy_SysClk_ClkHfGetFrequency(0);
    rslt = _cyhal_clock_compute_div(input_hz, hz, 8, tolerance, &div);
    #else
    uint64_t input_hz = (uint64_t)Cy_SysClk_ClkHfGetFrequency(1);
    rslt = _cyhal_clock_compute_div(input_hz << 5, hz, 13, tolerance, &div);
    #endif

    if (CY_RSLT_SUCCESS == rslt)
    {
        #if defined(COMPONENT_CAT1A)
        Cy_SysClk_ClkFastSetDivider((uint8_t)(div - 1));
        #else
        uint32_t div_int = (div >> 5) - 1;
        uint32_t div_frac = div & 0x1F;
        Cy_SysClk_ClkFastSrcSetDivider(clock->channel, (uint8_t)div_int, (uint8_t)div_frac);
        Cy_SysLib_SetWaitStates(false, 340);
        #endif
        SystemCoreClockUpdate();
    }
    return rslt;
}
static cy_rslt_t _cyhal_clock_set_divider_fast(cyhal_clock_t *clock, uint32_t divider)
{
    CY_UNUSED_PARAMETER(clock);

