RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_clock.c
    if (divider <= 256)
    {
        uint32_t divVal = divider - 1;
        #if defined(COMPONENT_CAT1A)
        Cy_SysClk_ClkFastSetDivider((uint8_t)divVal);
        #else
        Cy_SysClk_ClkFastSrcSetDivider(clock->channel, (uint8_t)divVal, 0);
        #endif
        SystemCoreClockUpdate();
        return CY_RSLT_SUCCESS;
    }
    return CYHAL_CLOCK_RSLT_ERR_FREQ;
}
static cy_rslt_t _cyhal_clock_get_sources_fast(const cyhal_clock_t *clock, const cyhal_resource_inst_t **sources[], uint32_t *count)
{
    CY_UNUSED_PARAMETER(clock);

    static const cyhal_resource_inst_t *_CYHAL_CLOCK_SOURCE_FAST[] =
    {
        #if defined(COMPONENT_CAT1C)
        &CYHAL_CLOCK_RSC_HF[1],
        #else
        &CYHAL_CLOCK_RSC_HF[0],
        #endif
    };

    *sources = _CYHAL_CLOCK_SOURCE_FAST;
    *count = sizeof(_CYHAL_CLOCK_SOURCE_FAST) / sizeof(_CYHAL_CLOCK_SOURCE_FAST[0]);
    return CY_RSLT_SUCCESS;
}

// SLOW
static uint32_t _cyhal_clock_get_frequency_slow(const cyhal_clock_t *clock)
{
    CY_UNUSED_PARAMETER(clock);
    return Cy_SysClk_ClkSlowGetFrequency();
}
static cy_rslt_t _cyhal_clock_set_frequency_slow(cyhal_clock_t *clock, uint32_t hz, const cyhal_clock_tolerance_t *tolerance)
{
    CY_UNUSED_PARAMETER(clock);

    uint32_t div;
    uint64_t input_hz = (uint64_t)Cy_SysClk_ClkPeriGetFrequency();
    cy_rslt_t rslt = _cyhal_clock_compute_div(input_hz, hz, 8, tolerance, &div);

    if (CY_RSLT_SUCCESS == rslt)
    {
        Cy_SysClk_ClkSlowSetDivider((uint8_t)(div - 1));
        SystemCoreClockUpdate();
    }

    return rslt;
}
static cy_rslt_t _cyhal_clock_set_divider_slow(cyhal_clock_t *clock, uint32_t divider)
{
    CY_UNUSED_PARAMETER(clock);

    if (divider <= 256)
    {
        uint32_t divVal = divider - 1;
        Cy_SysClk_ClkSlowSetDivider((uint8_t)divVal);
        SystemCoreClockUpdate();
        return CY_RSLT_SUCCESS;
    }
    return CYHAL_CLOCK_RSLT_ERR_FREQ;
}
static cy_rslt_t _cyhal_clock_get_sources_slow(const cyhal_clock_t *clock, const cyhal_resource_inst_t **sources[], uint32_t *count)
{
    CY_UNUSED_PARAMETER(clock);
    static const cyhal_resource_inst_t *_CYHAL_CLOCK_SOURCE_SLOW[] =
    {
        #if defined(COMPONENT_CAT1A)
        &CYHAL_CLOCK_RSC_PERI,
        #else
        &CYHAL_CLOCK_RSC_MEM,
        #endif
    };

    *sources = _CYHAL_CLOCK_SOURCE_SLOW;
    *count = sizeof(_CYHAL_CLOCK_SOURCE_SLOW) / sizeof(_CYHAL_CLOCK_SOURCE_SLOW[0]);
    return CY_RSLT_SUCCESS;
}
#endif
#if defined(COMPONENT_CAT1B)
#if SRSS_ECO_PRESENT
// ECO_PRESCALER - NOTE: This clock is not supported on any device yet
static uint32_t _cyhal_clock_get_frequency_eco_prescaler(const cyhal_clock_t *clock)
{
    CY_UNUSED_PARAMETER(clock);
    //return Cy_SysClk_EcoPrescalerGetFrequency();
    return 0;
}
static cy_rslt_t _cyhal_clock_set_divider_eco_prescaler(cyhal_clock_t *clock, uint32_t divider)
{
    CY_UNUSED_PARAMETER(clock);
    CY_UNUSED_PARAMETER(divider);

    return CYHAL_CLOCK_RSLT_ERR_NOT_SUPPORTED;
}
static cy_rslt_t _cyhal_clock_get_sources_eco_prescaler(const cyhal_clock_t *clock, const cyhal_resource_inst_t **sources[], uint32_t *count)
{
    CY_UNUSED_PARAMETER(clock);
    CY_UNUSED_PARAMETER(sources);
    CY_UNUSED_PARAMETER(count);

    return CYHAL_CLOCK_RSLT_ERR_NOT_SUPPORTED;
}
#endif

#if SRSS_BACKUP_S40E_LPECO_PRESENT
// LPECO_PRESCALER - NOTE: This clock is not supported on any device yet
static uint32_t _cyhal_clock_get_frequency_lpeco_prescaler(const cyhal_clock_t *clock)
{
    CY_UNUSED_PARAMETER(clock);
    return Cy_SysClk_LpEcoPrescalerGetFrequency();
}
static cy_rslt_t _cyhal_clock_set_divider_lpeco_prescaler(cyhal_clock_t *clock, uint32_t divider)
{
    CY_UNUSED_PARAMETER(clock);
    CY_UNUSED_PARAMETER(divider);

    return CYHAL_CLOCK_RSLT_ERR_NOT_SUPPORTED;
}
static cy_rslt_t _cyhal_clock_get_sources_lpeco_prescaler(const cyhal_clock_t *clock, const cyhal_resource_inst_t **sources[], uint32_t *count)
{
    CY_UNUSED_PARAMETER(clock);
    CY_UNUSED_PARAMETER(sources);
    CY_UNUSED_PARAMETER(count);

    return CYHAL_CLOCK_RSLT_ERR_NOT_SUPPORTED;
}
#endif
#endif

// MEM
#if defined(COMPONENT_CAT1C)
static cy_rslt_t _cyhal_clock_set_divider_mem(cyhal_clock_t *clock, uint32_t divider)
{
    CY_UNUSED_PARAMETER(clock);
    if (divider <= 256)
    {
        uint32_t divVal = divider - 1;
        Cy_SysClk_ClkMemSetDivider((uint8_t)divVal);
        SystemCoreClockUpdate();
        return CY_RSLT_SUCCESS;
    }
    return CYHAL_CLOCK_RSLT_ERR_FREQ;
}
static uint32_t _cyhal_clock_get_frequency_mem(const cyhal_clock_t *clock)
{
    CY_UNUSED_PARAMETER(clock);
    return Cy_SysClk_ClkMemGetFrequency();
}
static cy_rslt_t _cyhal_clock_set_frequency_mem(cyhal_clock_t *clock, uint32_t hz, const cyhal_clock_tolerance_t *tolerance)
{
    CY_UNUSED_PARAMETER(clock);

    uint32_t div;
    uint64_t input_hz = (uint64_t)Cy_SysClk_ClkHfGetFrequency(0);
    cy_rslt_t rslt = _cyhal_clock_compute_div(input_hz, hz, 8, tolerance, &div);
    if (CY_RSLT_SUCCESS == rslt)
    {
        Cy_SysClk_ClkMemSetDivider((uint8_t)(div - 1));
        SystemCoreClockUpdate();
    }
    return rslt;
}
static cy_rslt_t _cyhal_clock_get_sources_mem(const cyhal_clock_t *clock, const cyhal_resource_inst_t **sources[], uint32_t *count)
{
    CY_UNUSED_PARAMETER(clock);

    static const cyhal_resource_inst_t *_CYHAL_CLOCK_SOURCE_MEM[] =
    {
        &CYHAL_CLOCK_RSC_HF[0],
    };
    *sources = _CYHAL_CLOCK_SOURCE_MEM;
    *count = 1;
    return CY_RSLT_SUCCESS;
}
#endif

// PERI
static uint32_t _cyhal_clock_get_frequency_peri(const cyhal_clock_t *clock)
{
    CY_UNUSED_PARAMETER(clock);
#if defined(COMPONENT_CAT1C)
    if(clock->channel == 0)
#endif
#if defined(COMPONENT_CAT1A) || defined(COMPONENT_CAT1C)
    {
        return Cy_SysClk_ClkPeriGetFrequency();
    }
#endif
// TODO: CAT1D to be confirmed here
#if defined(COMPONENT_CAT1B) || defined(COMPONENT_CAT1C) || defined(COMPONENT_CAT1D)
    uint8_t hfclk = _cyhal_utils_get_hfclk_for_peri_group(clock->channel);
    return Cy_SysClk_ClkHfGetFrequency(hfclk) / (Cy_SysClk_PeriGroupGetDivider(clock->channel) + 1);
#endif
}
static cy_rslt_t _cyhal_clock_set_frequency_peri(cyhal_clock_t *clock, uint32_t hz, const cyhal_clock_tolerance_t *tolerance)
{
    CY_UNUSED_PARAMETER(clock);

    uint32_t div;
    cy_rslt_t rslt;
#if defined(COMPONENT_CAT1C)
    if(clock->channel == 0)
#endif
#if defined(COMPONENT_CAT1A) || defined(COMPONENT_CAT1C)
    {
        uint64_t input_hz = (uint64_t)Cy_SysClk_ClkHfGetFrequency(0);
        rslt = _cyhal_clock_compute_div(input_hz, hz, 8, tolerance, &div);

        if (CY_RSLT_SUCCESS == rslt)
        {
            Cy_SysClk_ClkPeriSetDivider((uint8_t)(div - 1));
            SystemCoreClockUpdate();
        }
        return rslt;
    }
#endif
// TODO: CAT1D to be confirmed here
#if defined(COMPONENT_CAT1B) || defined(COMPONENT_CAT1C) || defined(COMPONENT_CAT1D)
    uint64_t input_hz = (uint64_t)Cy_SysClk_ClkHfGetFrequency(clock->channel == 1 ? 1 : 0);
    rslt = _cyhal_clock_compute_div(input_hz, hz, 8, tolerance, &div);

    if (CY_RSLT_SUCCESS == rslt)
    {
        Cy_SysClk_PeriGroupSetDivider(clock->channel, (uint8_t)(div - 1));
    }
    return rslt;
#endif
}
static cy_rslt_t _cyhal_clock_set_divider_peri(cyhal_clock_t *clock, uint32_t divider)
{
    CY_UNUSED_PARAMETER(clock);
    if (divider <= 256)
    {
        uint32_t divVal = divider - 1;
    #if defined(COMPONENT_CAT1C)
        if (clock->channel == 0)
    #endif
#if defined(COMPONENT_CAT1A) || defined(COMPONENT_CAT1C)
        {
            Cy_SysClk_ClkPeriSetDivider((uint8_t)divVal);
            SystemCoreClockUpdate();
            return CY_RSLT_SUCCESS;
        }
#endif
// TODO: CAT1D to be confirmed here
#if defined(COMPONENT_CAT1B) || defined(COMPONENT_CAT1C) || defined(COMPONENT_CAT1D)
        Cy_SysClk_PeriGroupSetDivider(clock->channel, (uint8_t)divVal);
        SystemCoreClockUpdate();
        return CY_RSLT_SUCCESS;
#endif
    }
    return CYHAL_CLOCK_RSLT_ERR_FREQ;
}
static cy_rslt_t _cyhal_clock_get_sources_peri(const cyhal_clock_t *clock, const cyhal_resource_inst_t **sources[], uint32_t *count)
{
#if defined(COMPONENT_CAT1A)
    CY_UNUSED_PARAMETER(clock);
#endif
#if defined(COMPONENT_CAT1C)
    if (clock->channel == 0)
#endif
#if defined(COMPONENT_CAT1A) || defined(COMPONENT_CAT1C)
    {
        static const cyhal_resource_inst_t *_CYHAL_CLOCK_SOURCE_PERI[] =
        {
            &CYHAL_CLOCK_RSC_HF[0],
        };

        *sources = _CYHAL_CLOCK_SOURCE_PERI;
        *count = 1;
        return CY_RSLT_SUCCESS;
    }
#endif
// TODO: CAT1D to be confirmed here
#if defined (COMPONENT_CAT1B) || defined(COMPONENT_CAT1C) || defined(COMPONENT_CAT1D)
    uint8_t hfclk = _cyhal_utils_get_hfclk_for_peri_group(clock->channel);
    return _cyhal_clock_get_sources_peri_peripheral(hfclk, sources, count);
#endif
}

// PUMP
static bool _cyhal_clock_is_enabled_pump(const cyhal_clock_t *clock)
{
    CY_UNUSED_PARAMETER(clock);
    return Cy_SysClk_ClkPumpIsEnabled();
}
static cy_rslt_t _cyhal_clock_set_enabled_pump(cyhal_clock_t *clock, bool enabled, bool wait_for_lock)
{
    CY_UNUSED_PARAMETER(clock);
    CY_UNUSED_PARAMETER(wait_for_lock);

