RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_clock.c
    if (enabled)
        Cy_SysClk_ClkPumpEnable();
    else
        Cy_SysClk_ClkPumpDisable();
    return CY_RSLT_SUCCESS;
}
static uint32_t _cyhal_clock_get_frequency_pump(const cyhal_clock_t *clock)
{
    CY_UNUSED_PARAMETER(clock);
    return Cy_SysClk_ClkPumpGetFrequency();
}
static cy_rslt_t _cyhal_clock_set_divider_pump(cyhal_clock_t *clock, uint32_t divider)
{
    CY_UNUSED_PARAMETER(clock);

    cy_en_clkpump_divide_t divVal;
    switch (divider)
    {
        case 1:
            divVal = CY_SYSCLK_PUMP_NO_DIV;
            break;
        case 2:
            divVal = CY_SYSCLK_PUMP_DIV_2;
            break;
        case 4:
            divVal = CY_SYSCLK_PUMP_DIV_4;
            break;
        case 8:
            divVal = CY_SYSCLK_PUMP_DIV_8;
            break;
        case 16:
            divVal = CY_SYSCLK_PUMP_DIV_16;
            break;
        default:
            return CYHAL_CLOCK_RSLT_ERR_FREQ;
    }
    Cy_SysClk_ClkPumpSetDivider(divVal);
    return CY_RSLT_SUCCESS;
}
#define _cyhal_clock_get_sources_pump	_cyhal_clock_get_sources_hf
static cy_rslt_t _cyhal_clock_set_source_pump(cyhal_clock_t *clock, const cyhal_clock_t *source)
{
    CY_UNUSED_PARAMETER(clock);

    if (source->block == CYHAL_CLOCK_BLOCK_PATHMUX || source->block == CYHAL_CLOCK_BLOCK_FLL)
    {
        Cy_SysClk_ClkPumpSetSource((cy_en_clkpump_in_sources_t)source->channel);
        return CY_RSLT_SUCCESS;
    }
#if defined(COMPONENT_CAT1A)
    else if (source->block == CYHAL_CLOCK_BLOCK_PLL)
#elif defined(COMPONENT_CAT1B) || defined(COMPONENT_CAT1C)
    else if ((source->block == CYHAL_CLOCK_BLOCK_PLL200) || (source->block == CYHAL_CLOCK_BLOCK_PLL400))
// TODO: CAT1D to be fixed here
#elif defined(COMPONENT_CAT1D)
    else if (0)
#endif
    {
        Cy_SysClk_ClkPumpSetSource((cy_en_clkpump_in_sources_t)(source->channel + 1));
        return CY_RSLT_SUCCESS;
    }
    else
        return CYHAL_CLOCK_RSLT_ERR_SOURCE;
}

// TIMER
// TODO: Need to enable timer functionality for CAT1C once PDL team updates clk_timer API's
#if defined(COMPONENT_CAT1A)
static bool _cyhal_clock_is_enabled_timer(const cyhal_clock_t *clock)
{
    CY_UNUSED_PARAMETER(clock);
    return Cy_SysClk_ClkTimerIsEnabled();
}
static cy_rslt_t _cyhal_clock_set_enabled_timer(cyhal_clock_t *clock, bool enabled, bool wait_for_lock)
{
    CY_UNUSED_PARAMETER(clock);
    CY_UNUSED_PARAMETER(wait_for_lock);

    if (enabled)
        Cy_SysClk_ClkTimerEnable();
    else
        Cy_SysClk_ClkTimerDisable();
    return CY_RSLT_SUCCESS;
}
static uint32_t _cyhal_clock_get_frequency_timer(const cyhal_clock_t *clock)
{
    CY_UNUSED_PARAMETER(clock);
    return Cy_SysClk_ClkTimerGetFrequency();
}
static cy_rslt_t _cyhal_clock_set_divider_timer(cyhal_clock_t *clock, uint32_t divider)
{
    CY_UNUSED_PARAMETER(clock);

    if (divider <= 256)
    {
        uint32_t divVal = divider - 1;
        Cy_SysClk_ClkTimerSetDivider((uint8_t)divVal);
        return CY_RSLT_SUCCESS;
    }
    return CYHAL_CLOCK_RSLT_ERR_FREQ;
}
static cy_rslt_t _cyhal_clock_get_sources_timer(const cyhal_clock_t *clock, const cyhal_resource_inst_t **sources[], uint32_t *count)
{
    CY_UNUSED_PARAMETER(clock);
    static const cyhal_resource_inst_t *_CYHAL_CLOCK_SOURCE_TIMER[] =
    {
        &CYHAL_CLOCK_RSC_IMO,
        &CYHAL_CLOCK_RSC_HF[0],
    };

    *sources = _CYHAL_CLOCK_SOURCE_TIMER;
    *count = sizeof(_CYHAL_CLOCK_SOURCE_TIMER) / sizeof(_CYHAL_CLOCK_SOURCE_TIMER[0]);
    return CY_RSLT_SUCCESS;
}
static cy_rslt_t _cyhal_clock_set_source_timer(cyhal_clock_t *clock, const cyhal_clock_t *source)
{
    CY_UNUSED_PARAMETER(clock);

    if (source->block == CYHAL_CLOCK_BLOCK_IMO)
    {
        Cy_SysClk_ClkTimerSetSource(CY_SYSCLK_CLKTIMER_IN_IMO);
        return CY_RSLT_SUCCESS;
    }
    else if (source->block == CYHAL_CLOCK_BLOCK_HF && source->channel == 0)
    {
        Cy_SysClk_ClkTimerSetSource(CY_SYSCLK_CLKTIMER_IN_HF0_NODIV);
        return CY_RSLT_SUCCESS;
    }
    return CYHAL_CLOCK_RSLT_ERR_SOURCE;
}
#endif

// BAK
static uint32_t _cyhal_clock_get_frequency_bak(const cyhal_clock_t *clock)
{
    CY_UNUSED_PARAMETER(clock);
    cy_en_clkbak_in_sources_t src = Cy_SysClk_ClkBakGetSource();
#if SRSS_BACKUP_PRESENT
    if (src == CY_SYSCLK_BAK_IN_WCO)
        return CY_SYSCLK_WCO_FREQ;
// TODO: CAT1D to be fixed here
#else
    (void)src;
#endif
    return _cyhal_clock_get_lf_frequency();
}
static cy_rslt_t _cyhal_clock_get_sources_bak(const cyhal_clock_t *clock, const cyhal_resource_inst_t **sources[], uint32_t *count)
{
    CY_UNUSED_PARAMETER(clock);
    static const cyhal_resource_inst_t *_CYHAL_CLOCK_SOURCE_BAK[] =
    {
        &CYHAL_CLOCK_RSC_LF,
    #if SRSS_BACKUP_PRESENT
        &CYHAL_CLOCK_RSC_WCO,
    #endif
    #if defined(COMPONENT_CAT1C)
        &CYHAL_CLOCK_RSC_ILO[0],
    #elif defined(COMPONENT_CAT1B)
        &CYHAL_CLOCK_RSC_ILO,
    #endif
    #if defined(COMPONENT_CAT1A) || defined(COMPONENT_CAT1B)
    #if _CYHAL_SRSS_PILO_PRESENT
        &CYHAL_CLOCK_RSC_PILO,
    #endif
    #endif
    #if defined(COMPONENT_CAT1B)
    #if SRSS_BACKUP_S40E_LPECO_PRESENT
        &CYHAL_CLOCK_RSC_LPECO_PRESCALER,
    #endif
    #endif
    };

    *sources = _CYHAL_CLOCK_SOURCE_BAK;
    *count = sizeof(_CYHAL_CLOCK_SOURCE_BAK) / sizeof(_CYHAL_CLOCK_SOURCE_BAK[0]);
    return CY_RSLT_SUCCESS;
}
static cy_rslt_t _cyhal_clock_set_source_bak(cyhal_clock_t *clock, const cyhal_clock_t *source)
{
    CY_UNUSED_PARAMETER(clock);

    switch (source->block)
    {
        case CYHAL_CLOCK_BLOCK_WCO:
            Cy_SysClk_ClkBakSetSource(CY_SYSCLK_BAK_IN_WCO);
            return CY_RSLT_SUCCESS;
        case CYHAL_CLOCK_BLOCK_LF:
            Cy_SysClk_ClkBakSetSource(CY_SYSCLK_BAK_IN_CLKLF);
            return CY_RSLT_SUCCESS;
#if defined(COMPONENT_CAT1B) || defined(COMPONENT_CAT1C)
        case CYHAL_CLOCK_BLOCK_ILO:
            if(1 == source->channel)
            {
                return CYHAL_CLOCK_RSLT_ERR_SOURCE;
            }
            Cy_SysClk_ClkBakSetSource(CY_SYSCLK_BAK_IN_ILO);
            return CY_RSLT_SUCCESS;
#if _CYHAL_SRSS_PILO_PRESENT
        case CYHAL_CLOCK_BLOCK_PILO:
            Cy_SysClk_ClkBakSetSource(CY_SYSCLK_BAK_IN_PILO);
            return CY_RSLT_SUCCESS;
#endif
#if SRSS_BACKUP_S40E_LPECO_PRESENT
        case CYHAL_CLOCK_BLOCK_LPECO_PRESCALER:
            Cy_SysClk_ClkBakSetSource(CY_SYSCLK_BAK_IN_LPECO_PRESCALER);
            return CY_RSLT_SUCCESS;
#endif
#endif
        default:
            CY_ASSERT(false); //Unhandled clock
            return CYHAL_CLOCK_RSLT_ERR_SOURCE;
    }
}

// ALT_SYS_TICK
static uint32_t _cyhal_clock_get_frequency_alt_sys_tick(const cyhal_clock_t *clock)
{
    CY_UNUSED_PARAMETER(clock);
    CY_ASSERT(false); // This is not supported at this time
    return 0;
}
static cy_rslt_t _cyhal_clock_get_sources_alt_sys_tick(const cyhal_clock_t *clock, const cyhal_resource_inst_t **sources[], uint32_t *count)
{
    CY_UNUSED_PARAMETER(clock);
    static const cyhal_resource_inst_t *_CYHAL_CLOCK_SOURCE_ALT_SYS_TICK[] =
    {
        &CYHAL_CLOCK_RSC_IMO,
    #if SRSS_ECO_PRESENT
        &CYHAL_CLOCK_RSC_ECO,
    #endif
        &CYHAL_CLOCK_RSC_LF,
#if defined(COMPONENT_CAT1A)
        &CYHAL_CLOCK_RSC_TIMER, /* Technically present on CAT1B and CAT1C, but deprecated */
#endif
#if defined(COMPONENT_CAT1A) || defined(COMPONENT_CAT1C)
#if defined(COMPONENT_CAT1C)
        &CYHAL_CLOCK_RSC_FAST[0],
        &CYHAL_CLOCK_RSC_FAST[1],
#else
        &CYHAL_CLOCK_RSC_FAST,
#endif
        &CYHAL_CLOCK_RSC_SLOW,
#elif defined(COMPONENT_CAT1B)
        &CYHAL_CLOCK_RSC_HF[0], /* CPU clock */
#endif
    };

    *sources = _CYHAL_CLOCK_SOURCE_ALT_SYS_TICK;
    *count = sizeof(_CYHAL_CLOCK_SOURCE_ALT_SYS_TICK) / sizeof(_CYHAL_CLOCK_SOURCE_ALT_SYS_TICK[0]);
    return CY_RSLT_SUCCESS;
}
static cy_rslt_t _cyhal_clock_set_source_alt_sys_tick(cyhal_clock_t *clock, const cyhal_clock_t *source)
{
    CY_UNUSED_PARAMETER(clock);

    switch (source->block)
    {
        case CYHAL_CLOCK_BLOCK_LF:
            Cy_SysTick_SetClockSource(CY_SYSTICK_CLOCK_SOURCE_CLK_LF);
            return CY_RSLT_SUCCESS;
        case CYHAL_CLOCK_BLOCK_IMO:
            Cy_SysTick_SetClockSource(CY_SYSTICK_CLOCK_SOURCE_CLK_IMO);
            return CY_RSLT_SUCCESS;
#if SRSS_ECO_PRESENT
        case CYHAL_CLOCK_BLOCK_ECO:
            Cy_SysTick_SetClockSource(CY_SYSTICK_CLOCK_SOURCE_CLK_ECO);
            return CY_RSLT_SUCCESS;
#endif
#if defined(COMPONENT_CAT1A) || defined(COMPONENT_CAT1C)
#if defined(COMPONENT_CAT1A)
        case CYHAL_CLOCK_BLOCK_TIMER:
            Cy_SysTick_SetClockSource(CY_SYSTICK_CLOCK_SOURCE_CLK_TIMER);
            return CY_RSLT_SUCCESS;
#endif
        case CYHAL_CLOCK_BLOCK_FAST:
        case CYHAL_CLOCK_BLOCK_SLOW:
            Cy_SysTick_SetClockSource(CY_SYSTICK_CLOCK_SOURCE_CLK_CPU);
            return CY_RSLT_SUCCESS;
#endif
        default:
            CY_ASSERT(false); //Unhandled clock
            return CYHAL_CLOCK_RSLT_ERR_SOURCE;
    }
}

// Peripheral
static bool _cyhal_clock_is_enabled_peripheral(const cyhal_clock_t *clock)
{
    return _cyhal_utils_peri_pclk_is_divider_enabled(_CYHAL_CLOCK_GET_PCLK_GR_NUM(clock->block), clock);
}
static cy_rslt_t _cyhal_clock_set_enabled_peripheral(cyhal_clock_t *clock, bool enabled, bool wait_for_lock)
{
    CY_UNUSED_PARAMETER(wait_for_lock);

    return (enabled)
        ? _cyhal_utils_peri_pclk_enable_divider(_CYHAL_CLOCK_GET_PCLK_GR_NUM(clock->block), clock)
        : _cyhal_utils_peri_pclk_disable_divider(_CYHAL_CLOCK_GET_PCLK_GR_NUM(clock->block), clock);
}
static uint32_t _cyhal_clock_get_frequency_peripheral(const cyhal_clock_t *clock)
{
    return _cyhal_utils_peri_pclk_get_frequency(_CYHAL_CLOCK_GET_PCLK_GR_NUM(clock->block), clock);
}
static cy_rslt_t _cyhal_clock_set_frequency_peripheral(cyhal_clock_t *clock, uint32_t hz, const cyhal_clock_tolerance_t *tolerance)
{
    CY_UNUSED_PARAMETER(clock);
    CY_UNUSED_PARAMETER(tolerance);

    // blocks 0b00 & 0b01 are integer, 0b10 & 0b11 are fractional
    uint32_t div;

