RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_clock.c
#if defined(COMPONENT_CAT1A)
    uint64_t input_hz = (uint64_t)Cy_SysClk_ClkPeriGetFrequency();
// TODO: CAT1D to be confirmed here
#elif defined(COMPONENT_CAT1B) || defined(COMPONENT_CAT1C) || defined(COMPONENT_CAT1D)
    uint8_t group = _CYHAL_PERIPHERAL_GROUP_GET_GROUP(clock->block);
    uint8_t hfclk = _cyhal_utils_get_hfclk_for_peri_group(group);
    uint64_t input_hz = (uint64_t)Cy_SysClk_ClkHfGetFrequency(hfclk);
#endif

    if ((clock->block & 0x02) == 0) // Integer (8 or 16)
    {
        uint32_t bits = (clock->block & 0x01) ? 16 : 8;
        cy_rslt_t rslt = _cyhal_clock_compute_div(input_hz, hz, bits, tolerance, &div);
        return (CY_RSLT_SUCCESS == rslt)
            ? _cyhal_utils_peri_pclk_set_divider(_CYHAL_CLOCK_GET_PCLK_GR_NUM(clock->block), clock, (div - 1))
            : rslt;
    }
    else //Fractional (16.5 or 24.5)
    {
        // Multiply input by 32 so we can treat the 5 fractional bits as though they are extentions of the integer divider
        // Leave the the desired frequency alone, so we can just strip out the integer & fractional bits at the end.
        uint32_t bits = (clock->block & 0x01) ? 29 : 21; // Integer bits + 5
        cy_rslt_t rslt = _cyhal_clock_compute_div(input_hz << 5, hz, bits, tolerance, &div);
        if (CY_RSLT_SUCCESS == rslt)
        {
            uint32_t div_int = (div >> 5) - 1;
            uint32_t div_frac = div & 0x1F;
            return _cyhal_utils_peri_pclk_set_frac_divider(_CYHAL_CLOCK_GET_PCLK_GR_NUM(clock->block), clock, div_int, div_frac);
        }
        else
            return rslt;
    }
}
static cy_rslt_t _cyhal_clock_set_divider_peripheral(cyhal_clock_t *clock, uint32_t divider)
{
    CY_UNUSED_PARAMETER(clock);

    // blocks 0b00 & 0b01 are integer, 0b10 & 0b11 are fractional
    return ((clock->block & 0x02) == 0)
        ? _cyhal_utils_peri_pclk_set_divider(_CYHAL_CLOCK_GET_PCLK_GR_NUM(clock->block), clock, divider - 1)
        : _cyhal_utils_peri_pclk_set_frac_divider(_CYHAL_CLOCK_GET_PCLK_GR_NUM(clock->block), clock, divider - 1, 0);
}
static cy_rslt_t _cyhal_clock_get_sources_peripheral(const cyhal_clock_t *clock, const cyhal_resource_inst_t **sources[], uint32_t *count)
{
#if defined(COMPONENT_CAT1A)
    return _cyhal_clock_get_sources_slow(clock, sources, count);
// TODO: CAT1D to be confirmed here
#elif defined(COMPONENT_CAT1B) || defined(COMPONENT_CAT1C) || defined(COMPONENT_CAT1D)
    uint8_t group = _CYHAL_PERIPHERAL_GROUP_GET_GROUP(clock->block);
    uint8_t hfclk = _cyhal_utils_get_hfclk_for_peri_group(group);
    return _cyhal_clock_get_sources_peri_peripheral(hfclk, sources, count);
#endif
}



/******************************************************************************
 ******************************* Clock Structs ********************************
 *****************************************************************************/

/* Use a structure with function pointers to allow the driver to optimize out entire clocks if they
 * are not used. We make two exceptions to this. HF and peripheral clocks are called directly by
 * the public functions. This allows those clocks to be optimized based on what the user actually
 * calls. This distinction is done based on what the user is most likely to do with the HAL driver.
 * HF & peripheral clocks are likely to be configured at runtime based on setting up different
 * peripherals. Other system clocks are likely to be be set once at startup and never modified.
 * Based on this, we design the code so the compiler can optimize out the unused items most
 * efficiently.
 */

typedef struct
{
    bool (*is_enabled)(const cyhal_clock_t *clock);
    cy_rslt_t (*set_enabled)(cyhal_clock_t *clock, bool enabled, bool wait_for_lock);
    uint32_t (*get_frequency)(const cyhal_clock_t *clock);
    cy_rslt_t (*set_frequency)(cyhal_clock_t *clock, uint32_t hz, const cyhal_clock_tolerance_t *tolerance);
    cy_rslt_t (*set_divider)(cyhal_clock_t *clock, uint32_t divider);
    cy_rslt_t (*get_sources)(const cyhal_clock_t *clock, const cyhal_resource_inst_t **sources[], uint32_t *count);
    cy_rslt_t (*set_source)(cyhal_clock_t *clock, const cyhal_clock_t *source);
    cyhal_clock_feature_t features;
} cyhal_clock_funcs_t;

static const cyhal_clock_funcs_t FUNCS_IMO =
{
    .features = CYHAL_CLOCK_FEATURE_NONE,
    .is_enabled = _cyhal_clock_is_enabled_true,
    .set_enabled = _cyhal_clock_set_enabled_unsupported,
    .get_frequency = _cyhal_clock_get_frequency_imo,
    .set_frequency = _cyhal_clock_set_frequency_unsupported,
    .set_divider = _cyhal_clock_set_divider_unsupported,
    .get_sources = _cyhal_clock_get_sources_none,
    .set_source = _cyhal_clock_set_source_unsupported,
};

#if defined(COMPONENT_CAT1B)
static const cyhal_clock_funcs_t FUNCS_IHO =
{
    .features = CYHAL_CLOCK_FEATURE_ENABLE,
    .is_enabled = _cyhal_clock_is_enabled_iho,
    .set_enabled = _cyhal_clock_set_enabled_iho,
    .get_frequency = _cyhal_clock_get_frequency_iho,
    .set_frequency = _cyhal_clock_set_frequency_unsupported,
    .set_divider = _cyhal_clock_set_divider_unsupported,
    .get_sources = _cyhal_clock_get_sources_none,
    .set_source = _cyhal_clock_set_source_unsupported,
};
#endif

#if defined(COMPONENT_CAT1C)
static const cyhal_clock_funcs_t FUNCS_MEM =
{
    .features = (cyhal_clock_feature_t)(CYHAL_CLOCK_FEATURE_DIVIDER | CYHAL_CLOCK_FEATURE_FREQUENCY),
    .is_enabled = _cyhal_clock_is_enabled_true,
    .set_enabled = _cyhal_clock_set_enabled_unsupported,
    .get_frequency = _cyhal_clock_get_frequency_mem,
    .set_frequency = _cyhal_clock_set_frequency_mem,
    .set_divider = _cyhal_clock_set_divider_mem,
    .get_sources = _cyhal_clock_get_sources_mem,
    .set_source = _cyhal_clock_set_source_unsupported,
};
#endif

#if SRSS_ECO_PRESENT
static const cyhal_clock_funcs_t FUNCS_ECO =
{
    .features = CYHAL_CLOCK_FEATURE_ENABLE,
    .is_enabled = _cyhal_clock_is_enabled_eco,
    .set_enabled = _cyhal_clock_set_enabled_eco,
    .get_frequency = _cyhal_clock_get_frequency_eco,
    .set_frequency = _cyhal_clock_set_frequency_unsupported,
    .set_divider = _cyhal_clock_set_divider_unsupported,
    .get_sources = _cyhal_clock_get_sources_none,
    .set_source = _cyhal_clock_set_source_unsupported,
};
#endif

static const cyhal_clock_funcs_t FUNCS_EXT =
{
    .features = CYHAL_CLOCK_FEATURE_FREQUENCY,
    .is_enabled = _cyhal_clock_is_enabled_ext,
    .set_enabled = _cyhal_clock_set_enabled_unsupported,
    .get_frequency = _cyhal_clock_get_frequency_ext,
    .set_frequency = _cyhal_clock_set_frequency_ext,
    .set_divider = _cyhal_clock_set_divider_unsupported,
    .get_sources = _cyhal_clock_get_sources_none,
    .set_source = _cyhal_clock_set_source_unsupported,
};

#if SRSS_ALTHF_PRESENT
static const cyhal_clock_funcs_t FUNCS_ALTHF =
{
    .features = CYHAL_CLOCK_FEATURE_NONE,
    .is_enabled = _cyhal_clock_is_enabled_althf,
    .set_enabled = _cyhal_clock_set_enabled_unsupported,
    .get_frequency = _cyhal_clock_get_frequency_althf,
    .set_frequency = _cyhal_clock_set_frequency_unsupported,
    .set_divider = _cyhal_clock_set_divider_unsupported,
    .get_sources = _cyhal_clock_get_sources_none,
    .set_source = _cyhal_clock_set_source_unsupported,
};
#endif

#if SRSS_ALTLF_PRESENT
static const cyhal_clock_funcs_t FUNCS_ALTLF =
{
    .features = CYHAL_CLOCK_FEATURE_NONE,
    .is_enabled = _cyhal_clock_is_enabled_altlf,
    .set_enabled = _cyhal_clock_set_enabled_unsupported,
    .get_frequency = _cyhal_clock_get_frequency_altlf,
    .set_frequency = _cyhal_clock_set_frequency_unsupported,
    .set_divider = _cyhal_clock_set_divider_unsupported,
    .get_sources = _cyhal_clock_get_sources_none,
    .set_source = _cyhal_clock_set_source_unsupported,
};
#endif

static const cyhal_clock_funcs_t FUNCS_ILO =
{
    .features = CYHAL_CLOCK_FEATURE_ENABLE,
    .is_enabled = _cyhal_clock_is_enabled_ilo,
    .set_enabled = _cyhal_clock_set_enabled_ilo,
    .get_frequency = _cyhal_clock_get_frequency_ilo,
    .set_frequency = _cyhal_clock_set_frequency_unsupported,
    .set_divider = _cyhal_clock_set_divider_unsupported,
    .get_sources = _cyhal_clock_get_sources_none,
    .set_source = _cyhal_clock_set_source_unsupported,
};

#if _CYHAL_SRSS_PILO_PRESENT
static const cyhal_clock_funcs_t FUNCS_PILO =
{
    .features = CYHAL_CLOCK_FEATURE_ENABLE,
    .is_enabled = _cyhal_clock_is_enabled_pilo,
    .set_enabled = _cyhal_clock_set_enabled_pilo,
    .get_frequency = _cyhal_clock_get_frequency_pilo,
    .set_frequency = _cyhal_clock_set_frequency_unsupported,
    .set_divider = _cyhal_clock_set_divider_unsupported,
    .get_sources = _cyhal_clock_get_sources_none,
    .set_source = _cyhal_clock_set_source_unsupported,
};
#endif

#if SRSS_BACKUP_PRESENT
static const cyhal_clock_funcs_t FUNCS_WCO =
{
    .features = CYHAL_CLOCK_FEATURE_ENABLE,
    .is_enabled = _cyhal_clock_is_enabled_wco,
    .set_enabled = _cyhal_clock_set_enabled_wco,
    .get_frequency = _cyhal_clock_get_frequency_wco,
    .set_frequency = _cyhal_clock_set_frequency_unsupported,
    .set_divider = _cyhal_clock_set_divider_unsupported,
    .get_sources = _cyhal_clock_get_sources_none,
    .set_source = _cyhal_clock_set_source_unsupported,
};
#endif

#if defined(COMPONENT_CAT1B) || (SRSS_MFO_PRESENT)
static const cyhal_clock_funcs_t FUNCS_MFO =
{
    .features = CYHAL_CLOCK_FEATURE_ENABLE,
    .is_enabled = _cyhal_clock_is_enabled_mfo,
    .set_enabled = _cyhal_clock_set_enabled_mfo,
    .get_frequency = _cyhal_clock_get_frequency_mfo,
    .set_frequency = _cyhal_clock_set_frequency_unsupported,
    .set_divider = _cyhal_clock_set_divider_unsupported,
    .get_sources = _cyhal_clock_get_sources_mfo,
    .set_source = _cyhal_clock_set_source_unsupported,
};
#endif

static const cyhal_clock_funcs_t FUNCS_PATHMUX =
{
    .features = CYHAL_CLOCK_FEATURE_SOURCE,
    .is_enabled = _cyhal_clock_is_enabled_true,
    .set_enabled = _cyhal_clock_set_enabled_unsupported,
    .get_frequency = _cyhal_clock_get_frequency_pathmux,
    .set_frequency = _cyhal_clock_set_frequency_unsupported,
    .set_divider = _cyhal_clock_set_divider_unsupported,
    .get_sources = _cyhal_clock_get_sources_pathmux,
    .set_source = _cyhal_clock_set_source_pathmux,
};

#if defined(COMPONENT_CAT1A) || defined(COMPONENT_CAT1C) || (SRSS_FLL_PRESENT)
static const cyhal_clock_funcs_t FUNCS_FLL =
{
    .features = (cyhal_clock_feature_t)(CYHAL_CLOCK_FEATURE_ENABLE | CYHAL_CLOCK_FEATURE_FREQUENCY),
    .is_enabled = _cyhal_clock_is_enabled_fll,
    .set_enabled = _cyhal_clock_set_enabled_fll,
    .get_frequency = _cyhal_clock_get_frequency_fll,
    .set_frequency = _cyhal_clock_set_frequency_fll,
    .set_divider = _cyhal_clock_set_divider_unsupported,
    .get_sources = _cyhal_clock_get_sources_fll,
    .set_source = _cyhal_clock_set_source_unsupported,
};
#endif

#if (_CYHAL_SRSS_NUM_PLL > 0)
static const cyhal_clock_funcs_t FUNCS_PLL =
{
    .features = (cyhal_clock_feature_t)(CYHAL_CLOCK_FEATURE_ENABLE | CYHAL_CLOCK_FEATURE_FREQUENCY),
    .is_enabled = _cyhal_clock_is_enabled_pll,
    .set_enabled = _cyhal_clock_set_enabled_pll,
    .get_frequency = _cyhal_clock_get_frequency_pll,
    .set_frequency = _cyhal_clock_set_frequency_pll,
    .set_divider = _cyhal_clock_set_divider_unsupported,
    .get_sources = _cyhal_clock_get_sources_pll,
    .set_source = _cyhal_clock_set_source_unsupported,
};
#endif

#if defined(COMPONENT_CAT1C)
#if (SRSS_NUM_PLL > 0)
#define FUNCS_PLL200 FUNCS_PLL
#endif
#if (SRSS_NUM_PLL400M > 0)
#define FUNCS_PLL400 FUNCS_PLL
#endif
#endif

static const cyhal_clock_funcs_t FUNCS_LF =
{
    .features = CYHAL_CLOCK_FEATURE_SOURCE,
    .is_enabled = _cyhal_clock_is_enabled_true,
    .set_enabled = _cyhal_clock_set_enabled_unsupported,
    .get_frequency = _cyhal_clock_get_frequency_lf,
    .set_frequency = _cyhal_clock_set_frequency_unsupported,
    .set_divider = _cyhal_clock_set_divider_unsupported,
    .get_sources = _cyhal_clock_get_sources_lf,
    .set_source = _cyhal_clock_set_source_lf,
};

#if defined(COMPONENT_CAT1B) || (SRSS_MFO_PRESENT)
static const cyhal_clock_funcs_t FUNCS_MF =
{
#if defined(COMPONENT_CAT1A) /* CAT1A only supports driving clk_mf from the MFO */
    .features = (cyhal_clock_feature_t)(CYHAL_CLOCK_FEATURE_ENABLE | CYHAL_CLOCK_FEATURE_DIVIDER | CYHAL_CLOCK_FEATURE_FREQUENCY),
#else
    .features = (cyhal_clock_feature_t)(CYHAL_CLOCK_FEATURE_ENABLE | CYHAL_CLOCK_FEATURE_DIVIDER | CYHAL_CLOCK_FEATURE_FREQUENCY | CYHAL_CLOCK_FEATURE_SOURCE),
#endif
    .is_enabled = _cyhal_clock_is_enabled_mf,
    .set_enabled = _cyhal_clock_set_enabled_mf,
    .get_frequency = _cyhal_clock_get_frequency_mf,
    .set_frequency = _cyhal_clock_set_frequency_mf,
    .set_divider = _cyhal_clock_set_divider_mf,
    .get_sources = _cyhal_clock_get_sources_mf,
    .set_source = _cyhal_clock_set_source_mf,
};
#endif

static const cyhal_clock_funcs_t FUNCS_HF =
{
    // NOTE: HF0 cannot be disabled, it would stop the MCUs. Ideally HF0 would not support
    // CYHAL_CLOCK_FEATURE_ENABLE, but this struct is never actually used in practice so it doesn't
    // matter.
    .features = (cyhal_clock_feature_t)(CYHAL_CLOCK_FEATURE_ENABLE | CYHAL_CLOCK_FEATURE_SOURCE | CYHAL_CLOCK_FEATURE_DIVIDER),
    .is_enabled = _cyhal_clock_is_enabled_hf,
    .set_enabled = _cyhal_clock_set_enabled_hf,
    .get_frequency = _cyhal_clock_get_frequency_hf,
    .set_frequency = _cyhal_clock_set_frequency_unsupported,
    .set_divider = _cyhal_clock_set_divider_hf,
    .get_sources = _cyhal_clock_get_sources_hf,
    .set_source = _cyhal_clock_set_source_hf,
};

