RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_clock.c
static const cyhal_clock_funcs_t FUNCS_PUMP =
{
    .features = (cyhal_clock_feature_t)(CYHAL_CLOCK_FEATURE_ENABLE | CYHAL_CLOCK_FEATURE_SOURCE | CYHAL_CLOCK_FEATURE_DIVIDER),
    .is_enabled = _cyhal_clock_is_enabled_pump,
    .set_enabled = _cyhal_clock_set_enabled_pump,
    .get_frequency = _cyhal_clock_get_frequency_pump,
    .set_frequency = _cyhal_clock_set_frequency_unsupported,
    .set_divider = _cyhal_clock_set_divider_pump,
    .get_sources = _cyhal_clock_get_sources_pump,
    .set_source = _cyhal_clock_set_source_pump,
};

#if defined(COMPONENT_CAT1A)
static const cyhal_clock_funcs_t FUNCS_TIMER =
{
    .features = (cyhal_clock_feature_t)(CYHAL_CLOCK_FEATURE_ENABLE | CYHAL_CLOCK_FEATURE_SOURCE | CYHAL_CLOCK_FEATURE_DIVIDER),
    .is_enabled = _cyhal_clock_is_enabled_timer,
    .set_enabled = _cyhal_clock_set_enabled_timer,
    .get_frequency = _cyhal_clock_get_frequency_timer,
    .set_frequency = _cyhal_clock_set_frequency_unsupported,
    .set_divider = _cyhal_clock_set_divider_timer,
    .get_sources = _cyhal_clock_get_sources_timer,
    .set_source = _cyhal_clock_set_source_timer,
};
#endif

static const cyhal_clock_funcs_t FUNCS_BAK =
{
    .features = CYHAL_CLOCK_FEATURE_SOURCE,
    .is_enabled = _cyhal_clock_is_enabled_true,
    .set_enabled = _cyhal_clock_set_enabled_unsupported,
    .get_frequency = _cyhal_clock_get_frequency_bak,
    .set_frequency = _cyhal_clock_set_frequency_unsupported,
    .set_divider = _cyhal_clock_set_divider_unsupported,
    .get_sources = _cyhal_clock_get_sources_bak,
    .set_source = _cyhal_clock_set_source_bak,
};

static const cyhal_clock_funcs_t FUNCS_ALT_SYS_TICK =
{
    .features = CYHAL_CLOCK_FEATURE_SOURCE,
    .is_enabled = _cyhal_clock_is_enabled_true,
    .set_enabled = _cyhal_clock_set_enabled_unsupported,
    .get_frequency = _cyhal_clock_get_frequency_alt_sys_tick,
    .set_frequency = _cyhal_clock_set_frequency_unsupported,
    .set_divider = _cyhal_clock_set_divider_unsupported,
    .get_sources = _cyhal_clock_get_sources_alt_sys_tick,
    .set_source = _cyhal_clock_set_source_alt_sys_tick,
};

#if defined(COMPONENT_CAT1A) || defined(COMPONENT_CAT1C)
static const cyhal_clock_funcs_t FUNCS_FAST =
{
    .features = (cyhal_clock_feature_t)(CYHAL_CLOCK_FEATURE_DIVIDER | CYHAL_CLOCK_FEATURE_FREQUENCY),
    .is_enabled = _cyhal_clock_is_enabled_true,
    .set_enabled = _cyhal_clock_set_enabled_unsupported,
    .get_frequency = _cyhal_clock_get_frequency_fast,
    .set_frequency = _cyhal_clock_set_frequency_fast,
    .set_divider = _cyhal_clock_set_divider_fast,
    .get_sources = _cyhal_clock_get_sources_fast,
    .set_source = _cyhal_clock_set_source_unsupported,
};

static const cyhal_clock_funcs_t FUNCS_SLOW =
{
    .features = (cyhal_clock_feature_t)(CYHAL_CLOCK_FEATURE_DIVIDER | CYHAL_CLOCK_FEATURE_FREQUENCY),
    .is_enabled = _cyhal_clock_is_enabled_true,
    .set_enabled = _cyhal_clock_set_enabled_unsupported,
    .get_frequency = _cyhal_clock_get_frequency_slow,
    .set_frequency = _cyhal_clock_set_frequency_slow,
    .set_divider = _cyhal_clock_set_divider_slow,
    .get_sources = _cyhal_clock_get_sources_slow,
    .set_source = _cyhal_clock_set_source_unsupported,
};
#endif
#if defined(COMPONENT_CAT1B)
#if SRSS_ECO_PRESENT
static const cyhal_clock_funcs_t FUNCS_ECO_PRESCALER =
{
    .features = (cyhal_clock_feature_t)(CYHAL_CLOCK_FEATURE_DIVIDER),
    .is_enabled = _cyhal_clock_is_enabled_true,
    .set_enabled = _cyhal_clock_set_enabled_unsupported,
    .get_frequency = _cyhal_clock_get_frequency_eco_prescaler,
    .set_frequency = _cyhal_clock_set_frequency_unsupported,
    .set_divider = _cyhal_clock_set_divider_eco_prescaler,
    .get_sources = _cyhal_clock_get_sources_eco_prescaler,
    .set_source = _cyhal_clock_set_source_unsupported,
};
#endif

#if SRSS_BACKUP_S40E_LPECO_PRESENT
static const cyhal_clock_funcs_t FUNCS_LPECO_PRESCALER =
{
    .features = (cyhal_clock_feature_t)(CYHAL_CLOCK_FEATURE_DIVIDER),
    .is_enabled = _cyhal_clock_is_enabled_true,
    .set_enabled = _cyhal_clock_set_enabled_unsupported,
    .get_frequency = _cyhal_clock_get_frequency_lpeco_prescaler,
    .set_frequency = _cyhal_clock_set_frequency_unsupported,
    .set_divider = _cyhal_clock_set_divider_lpeco_prescaler,
    .get_sources = _cyhal_clock_get_sources_lpeco_prescaler,
    .set_source = _cyhal_clock_set_source_unsupported,
};
#endif
#endif

static const cyhal_clock_funcs_t FUNCS_PERI =
{
    .features = (cyhal_clock_feature_t)(CYHAL_CLOCK_FEATURE_DIVIDER | CYHAL_CLOCK_FEATURE_FREQUENCY),
    .is_enabled = _cyhal_clock_is_enabled_true,
    .set_enabled = _cyhal_clock_set_enabled_unsupported,
    .get_frequency = _cyhal_clock_get_frequency_peri,
    .set_frequency = _cyhal_clock_set_frequency_peri,
    .set_divider = _cyhal_clock_set_divider_peri,
    .get_sources = _cyhal_clock_get_sources_peri,
    .set_source = _cyhal_clock_set_source_unsupported,
};

static const cyhal_clock_funcs_t FUNCS_PERIPHERAL =
{
    .features = (cyhal_clock_feature_t)(CYHAL_CLOCK_FEATURE_ENABLE | CYHAL_CLOCK_FEATURE_DIVIDER | CYHAL_CLOCK_FEATURE_FREQUENCY),
    .is_enabled = _cyhal_clock_is_enabled_peripheral,
    .set_enabled = _cyhal_clock_set_enabled_peripheral,
    .get_frequency = _cyhal_clock_get_frequency_peripheral,
    .set_frequency = _cyhal_clock_set_frequency_peripheral,
    .set_divider = _cyhal_clock_set_divider_peripheral,
    .get_sources = _cyhal_clock_get_sources_peripheral,
    .set_source = _cyhal_clock_set_source_unsupported,
};


static const cyhal_clock_funcs_t FUNCS_EMPTY =
{
    .features = CYHAL_CLOCK_FEATURE_NONE,
    .is_enabled = NULL,
    .set_enabled = NULL,
    .get_frequency = NULL,
    .set_frequency = NULL,
    .set_divider = NULL,
    .get_sources = NULL,
    .set_source = NULL,
};

const void* _cyhal_clock_get_funcs_pathmux(void) { return &FUNCS_PATHMUX; }
#if (_CYHAL_SRSS_NUM_PLL > 0)
const void* _cyhal_clock_get_funcs_pll(void) { return &FUNCS_PLL; }
#endif
// HF and peripheral functions are called directly from the public APIs and do not go through
// the struct lookup. This allows them to get optimized out based on what the user calls. We
// return FUNCS_EMPTY here so as to avoid unnecessarily pulling in all functions for those clocks.
const void* _cyhal_clock_get_funcs_hf(void) { return &FUNCS_EMPTY/*FUNCS_HF*/; }
const void* _cyhal_clock_get_funcs_peripheral(void) { return &FUNCS_EMPTY/*FUNCS_PERIPHERAL*/; }

