RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_clock.c
static const cyhal_clock_funcs_t* _cyhal_clock_get_funcs_all(cyhal_clock_block_t block)
{
	switch (block)
	{
		case CYHAL_CLOCK_BLOCK_IMO:
			return &FUNCS_IMO;
#if SRSS_ECO_PRESENT
		case CYHAL_CLOCK_BLOCK_ECO:
			return &FUNCS_ECO;
#endif
		case CYHAL_CLOCK_BLOCK_EXT:
			return &FUNCS_EXT;
#if SRSS_ALTHF_PRESENT
		case CYHAL_CLOCK_BLOCK_ALTHF:
			return &FUNCS_ALTHF;
#endif
#if SRSS_ALTLF_PRESENT
		case CYHAL_CLOCK_BLOCK_ALTLF:
			return &FUNCS_ALTLF;
#endif
		case CYHAL_CLOCK_BLOCK_ILO:
			return &FUNCS_ILO;
#if _CYHAL_SRSS_PILO_PRESENT
		case CYHAL_CLOCK_BLOCK_PILO:
			return &FUNCS_PILO;
#endif
#if SRSS_BACKUP_PRESENT
		case CYHAL_CLOCK_BLOCK_WCO:
			return &FUNCS_WCO;
#endif
#if defined(COMPONENT_CAT1B) || (SRSS_MFO_PRESENT)
		case CYHAL_CLOCK_BLOCK_MFO:
			return &FUNCS_MFO;
#endif
		case CYHAL_CLOCK_BLOCK_PATHMUX:
			return &FUNCS_PATHMUX;
#if defined(COMPONENT_CAT1A) || defined(COMPONENT_CAT1C) || (SRSS_FLL_PRESENT)
		case CYHAL_CLOCK_BLOCK_FLL:
			return &FUNCS_FLL;
#endif
		case CYHAL_CLOCK_BLOCK_LF:
			return &FUNCS_LF;
#if defined(COMPONENT_CAT1B) || (SRSS_MFO_PRESENT)
		case CYHAL_CLOCK_BLOCK_MF:
			return &FUNCS_MF;
#endif
		case CYHAL_CLOCK_BLOCK_HF:
			return &FUNCS_HF;
		case CYHAL_CLOCK_BLOCK_PUMP:
			return &FUNCS_PUMP;
		case CYHAL_CLOCK_BLOCK_BAK:
			return &FUNCS_BAK;
		case CYHAL_CLOCK_BLOCK_ALT_SYS_TICK:
			return &FUNCS_ALT_SYS_TICK;
		case CYHAL_CLOCK_BLOCK_PERI:
			return &FUNCS_PERI;
#if defined(COMPONENT_CAT1A)
#if (_CYHAL_SRSS_NUM_PLL > 0)
		case CYHAL_CLOCK_BLOCK_PLL:
			return &FUNCS_PLL;
#endif
#endif
#if defined(COMPONENT_CAT1C)
        case CYHAL_CLOCK_BLOCK_MEM:
            return &FUNCS_MEM;
#endif 
#if defined(COMPONENT_CAT1A) || defined(COMPONENT_CAT1C)
#if defined(COMPONENT_CAT1A)
		case CYHAL_CLOCK_BLOCK_TIMER:
			return &FUNCS_TIMER;
#endif
		case CYHAL_CLOCK_BLOCK_FAST:
			return &FUNCS_FAST;
		case CYHAL_CLOCK_BLOCK_SLOW:
			return &FUNCS_SLOW;
#endif
#if defined(COMPONENT_CAT1B) || defined(COMPONENT_CAT1C)
#if (_CYHAL_SRSS_NUM_PLL > 0)
		case CYHAL_CLOCK_BLOCK_PLL200:
            return &FUNCS_PLL200;
		case CYHAL_CLOCK_BLOCK_PLL400:
			return &FUNCS_PLL400;
#endif
#endif 
#if defined(COMPONENT_CAT1B)
		case CYHAL_CLOCK_BLOCK_IHO:
			return &FUNCS_IHO;
#if SRSS_ECO_PRESENT
		case CYHAL_CLOCK_BLOCK_ECO_PRESCALER:
			return &FUNCS_ECO_PRESCALER;
#endif
#if SRSS_BACKUP_S40E_LPECO_PRESENT
        case CY_SYSCLK_CLKLF_IN_LPECO_PRESCALER:
			return &FUNCS_LPECO_PRESCALER;
#endif
#endif
		default:
			return &FUNCS_PERIPHERAL;
	}
}



#define _CYHAL_CLOCK_CREATE(x,y)	{ .block = (CYHAL_CLOCK_BLOCK_##x), .channel = (y), .reserved = false, .funcs = &(FUNCS_##x) }

const cyhal_clock_t CYHAL_CLOCK_IMO = _CYHAL_CLOCK_CREATE(IMO, 0);
const cyhal_clock_t CYHAL_CLOCK_EXT = _CYHAL_CLOCK_CREATE(EXT, 0);
#if defined(COMPONENT_CAT1C)
const cyhal_clock_t CYHAL_CLOCK_ILO[_CYHAL_SRSS_NUM_ILO] =
{
    _CYHAL_CLOCK_CREATE(ILO, 0),
    #if (SRSS_HT_VARIANT > 0)
    _CYHAL_CLOCK_CREATE(ILO, 1),
    #endif
};
#else
const cyhal_clock_t CYHAL_CLOCK_ILO = _CYHAL_CLOCK_CREATE(ILO, 0);
#endif
const cyhal_clock_t CYHAL_CLOCK_LF = _CYHAL_CLOCK_CREATE(LF, 0);
const cyhal_clock_t CYHAL_CLOCK_PUMP = _CYHAL_CLOCK_CREATE(PUMP, 0);
const cyhal_clock_t CYHAL_CLOCK_BAK = _CYHAL_CLOCK_CREATE(BAK, 0);
const cyhal_clock_t CYHAL_CLOCK_ALT_SYS_TICK = _CYHAL_CLOCK_CREATE(ALT_SYS_TICK, 0);

const cyhal_clock_t CYHAL_CLOCK_PATHMUX[SRSS_NUM_CLKPATH] =
{
    _CYHAL_CLOCK_CREATE(PATHMUX, 0),
#if (SRSS_NUM_CLKPATH > 1)
    _CYHAL_CLOCK_CREATE(PATHMUX, 1),
#endif
#if (SRSS_NUM_CLKPATH > 2)
    _CYHAL_CLOCK_CREATE(PATHMUX, 2),
#endif
#if (SRSS_NUM_CLKPATH > 3)
    _CYHAL_CLOCK_CREATE(PATHMUX, 3),
#endif
#if (SRSS_NUM_CLKPATH > 4)
    _CYHAL_CLOCK_CREATE(PATHMUX, 4),
#endif
#if (SRSS_NUM_CLKPATH > 5)
    _CYHAL_CLOCK_CREATE(PATHMUX, 5),
#endif
#if (SRSS_NUM_CLKPATH > 6)
    _CYHAL_CLOCK_CREATE(PATHMUX, 6),
#endif
#if (SRSS_NUM_CLKPATH > 7)
    _CYHAL_CLOCK_CREATE(PATHMUX, 7),
#endif
#if (SRSS_NUM_CLKPATH > 8)
    _CYHAL_CLOCK_CREATE(PATHMUX, 8),
#endif
#if (SRSS_NUM_CLKPATH > 9)
    _CYHAL_CLOCK_CREATE(PATHMUX, 9),
#endif
#if (SRSS_NUM_CLKPATH > 10)
    _CYHAL_CLOCK_CREATE(PATHMUX, 10),
#endif
#if (SRSS_NUM_CLKPATH > 11)
    _CYHAL_CLOCK_CREATE(PATHMUX, 11),
#endif
#if (SRSS_NUM_CLKPATH > 12)
    _CYHAL_CLOCK_CREATE(PATHMUX, 12),
#endif
#if (SRSS_NUM_CLKPATH > 13)
    _CYHAL_CLOCK_CREATE(PATHMUX, 13),
#endif
#if (SRSS_NUM_CLKPATH > 14)
    _CYHAL_CLOCK_CREATE(PATHMUX, 14),
#endif
#if (SRSS_NUM_CLKPATH > 15)
    _CYHAL_CLOCK_CREATE(PATHMUX, 15),
#endif
};

const cyhal_clock_t CYHAL_CLOCK_HF[SRSS_NUM_HFROOT] =
{
    _CYHAL_CLOCK_CREATE(HF, 0),
#if (SRSS_NUM_HFROOT > 1)
    _CYHAL_CLOCK_CREATE(HF, 1),
#endif
#if (SRSS_NUM_HFROOT > 2)
    _CYHAL_CLOCK_CREATE(HF, 2),
#endif
#if (SRSS_NUM_HFROOT > 3)
    _CYHAL_CLOCK_CREATE(HF, 3),
#endif
#if (SRSS_NUM_HFROOT > 4)
    _CYHAL_CLOCK_CREATE(HF, 4),
#endif
#if (SRSS_NUM_HFROOT > 5)
    _CYHAL_CLOCK_CREATE(HF, 5),
#endif
#if (SRSS_NUM_HFROOT > 6)
    _CYHAL_CLOCK_CREATE(HF, 6),
#endif
#if (SRSS_NUM_HFROOT > 7)
    _CYHAL_CLOCK_CREATE(HF, 7),
#endif
#if (SRSS_NUM_HFROOT > 8)
    _CYHAL_CLOCK_CREATE(HF, 8),
#endif
#if (SRSS_NUM_HFROOT > 9)
    _CYHAL_CLOCK_CREATE(HF, 9),
#endif
#if (SRSS_NUM_HFROOT > 10)
    _CYHAL_CLOCK_CREATE(HF, 10),
#endif
#if (SRSS_NUM_HFROOT > 11)
    _CYHAL_CLOCK_CREATE(HF, 11),
#endif
#if (SRSS_NUM_HFROOT > 12)
    _CYHAL_CLOCK_CREATE(HF, 12),
#endif
#if (SRSS_NUM_HFROOT > 13)
    _CYHAL_CLOCK_CREATE(HF, 13),
#endif
#if (SRSS_NUM_HFROOT > 14)
    _CYHAL_CLOCK_CREATE(HF, 14),
#endif
#if (SRSS_NUM_HFROOT > 15)
    _CYHAL_CLOCK_CREATE(HF, 15),
#endif
};

#if SRSS_ECO_PRESENT
const cyhal_clock_t CYHAL_CLOCK_ECO = _CYHAL_CLOCK_CREATE(ECO, 0);
#endif
#if SRSS_ALTHF_PRESENT
const cyhal_clock_t CYHAL_CLOCK_ALTHF = _CYHAL_CLOCK_CREATE(ALTHF, 0);
#endif
#if SRSS_ALTLF_PRESENT
const cyhal_clock_t CYHAL_CLOCK_ALTLF = _CYHAL_CLOCK_CREATE(ALTLF, 0);
#endif
#if _CYHAL_SRSS_PILO_PRESENT
const cyhal_clock_t CYHAL_CLOCK_PILO = _CYHAL_CLOCK_CREATE(PILO, 0);
#endif
#if SRSS_BACKUP_PRESENT
const cyhal_clock_t CYHAL_CLOCK_WCO = _CYHAL_CLOCK_CREATE(WCO, 0);
#endif
#if defined(COMPONENT_CAT1B) || (SRSS_MFO_PRESENT)
const cyhal_clock_t CYHAL_CLOCK_MFO = _CYHAL_CLOCK_CREATE(MFO, 0);
const cyhal_clock_t CYHAL_CLOCK_MF = _CYHAL_CLOCK_CREATE(MF, 0);
#endif
#if defined(COMPONENT_CAT1C)
const cyhal_clock_t CYHAL_CLOCK_MEM = _CYHAL_CLOCK_CREATE(MEM, 0);
#endif

#if defined(COMPONENT_CAT1A) || defined(COMPONENT_CAT1C) || (SRSS_FLL_PRESENT)
const cyhal_clock_t CYHAL_CLOCK_FLL = _CYHAL_CLOCK_CREATE(FLL, 0);
#endif

#if defined(COMPONENT_CAT1A) || defined(COMPONENT_CAT1C)
#if defined(COMPONENT_CAT1C)
const cyhal_clock_t CYHAL_CLOCK_FAST[2] =
{
    _CYHAL_CLOCK_CREATE(FAST, 0),
    _CYHAL_CLOCK_CREATE(FAST, 1),
};
#else
const cyhal_clock_t CYHAL_CLOCK_FAST = _CYHAL_CLOCK_CREATE(FAST, 0);
#endif
const cyhal_clock_t CYHAL_CLOCK_SLOW = _CYHAL_CLOCK_CREATE(SLOW, 0);
#if defined(COMPONENT_CAT1A)
const cyhal_clock_t CYHAL_CLOCK_PERI = _CYHAL_CLOCK_CREATE(PERI, 0);
const cyhal_clock_t CYHAL_CLOCK_TIMER = _CYHAL_CLOCK_CREATE(TIMER, 0);
#endif

