RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_clock.c
#if (_CYHAL_SRSS_NUM_PLL > 0) && defined(COMPONENT_CAT1A)
const cyhal_clock_t CYHAL_CLOCK_PLL[_CYHAL_SRSS_NUM_PLL] =
{
    _CYHAL_CLOCK_CREATE(PLL, 0),
#if (_CYHAL_SRSS_NUM_PLL > 1)
    _CYHAL_CLOCK_CREATE(PLL, 1),
#endif
#if (_CYHAL_SRSS_NUM_PLL > 2)
    _CYHAL_CLOCK_CREATE(PLL, 2),
#endif
#if (_CYHAL_SRSS_NUM_PLL > 3)
    _CYHAL_CLOCK_CREATE(PLL, 3),
#endif
#if (_CYHAL_SRSS_NUM_PLL > 4)
    _CYHAL_CLOCK_CREATE(PLL, 4),
#endif
#if (_CYHAL_SRSS_NUM_PLL > 5)
    _CYHAL_CLOCK_CREATE(PLL, 5),
#endif
#if (_CYHAL_SRSS_NUM_PLL > 6)
    _CYHAL_CLOCK_CREATE(PLL, 6),
#endif
#if (_CYHAL_SRSS_NUM_PLL > 7)
    _CYHAL_CLOCK_CREATE(PLL, 7),
#endif
#if (_CYHAL_SRSS_NUM_PLL > 8)
    _CYHAL_CLOCK_CREATE(PLL, 8),
#endif
#if (_CYHAL_SRSS_NUM_PLL > 9)
    _CYHAL_CLOCK_CREATE(PLL, 9),
#endif
#if (_CYHAL_SRSS_NUM_PLL > 10)
    _CYHAL_CLOCK_CREATE(PLL, 10),
#endif
#if (_CYHAL_SRSS_NUM_PLL > 11)
    _CYHAL_CLOCK_CREATE(PLL, 11),
#endif
#if (_CYHAL_SRSS_NUM_PLL > 12)
    _CYHAL_CLOCK_CREATE(PLL, 12),
#endif
#if (_CYHAL_SRSS_NUM_PLL > 13)
    _CYHAL_CLOCK_CREATE(PLL, 13),
#endif
#if (_CYHAL_SRSS_NUM_PLL > 14)
    _CYHAL_CLOCK_CREATE(PLL, 14),
#endif
};
#endif
#endif

#if defined(COMPONENT_CAT1B) || defined(COMPONENT_CAT1C)
#if defined(COMPONENT_CAT1B)
const cyhal_clock_t CYHAL_CLOCK_IHO = _CYHAL_CLOCK_CREATE(IHO, 0);
#if SRSS_ECO_PRESENT
const cyhal_clock_t CYHAL_CLOCK_ECO_PRESCALER = _CYHAL_CLOCK_CREATE(ECO_PRESCALER, 0);
#endif
#if SRSS_BACKUP_S40E_LPECO_PRESENT
const cyhal_clock_t CYHAL_CLOCK_LPECO_PRESCALER = _CYHAL_CLOCK_CREATE(LPECO_PRESCALER, 0);
#endif
#endif

const cyhal_clock_t CYHAL_CLOCK_PERI[CY_PERI_GROUP_NR] =
{
    _CYHAL_CLOCK_CREATE(PERI, 0),
#if (CY_PERI_GROUP_NR > 1)
    _CYHAL_CLOCK_CREATE(PERI, 1),
#endif
#if (CY_PERI_GROUP_NR > 2)
    _CYHAL_CLOCK_CREATE(PERI, 2),
#endif
#if (CY_PERI_GROUP_NR > 3)
    _CYHAL_CLOCK_CREATE(PERI, 3),
#endif
#if (CY_PERI_GROUP_NR > 4)
    _CYHAL_CLOCK_CREATE(PERI, 4),
#endif
#if (CY_PERI_GROUP_NR > 5)
    _CYHAL_CLOCK_CREATE(PERI, 5),
#endif
#if (CY_PERI_GROUP_NR > 6)
    _CYHAL_CLOCK_CREATE(PERI, 6),
#endif
#if (CY_PERI_GROUP_NR > 7)
    _CYHAL_CLOCK_CREATE(PERI, 7),
#endif
#if (CY_PERI_GROUP_NR > 8)
    _CYHAL_CLOCK_CREATE(PERI, 8),
#endif
#if (CY_PERI_GROUP_NR > 9)
    _CYHAL_CLOCK_CREATE(PERI, 9),
#endif
#if (CY_PERI_GROUP_NR > 10)
    _CYHAL_CLOCK_CREATE(PERI, 10),
#endif
#if (CY_PERI_GROUP_NR > 11)
    _CYHAL_CLOCK_CREATE(PERI, 11),
#endif
#if (CY_PERI_GROUP_NR > 12)
    _CYHAL_CLOCK_CREATE(PERI, 12),
#endif
#if (CY_PERI_GROUP_NR > 13)
    _CYHAL_CLOCK_CREATE(PERI, 13),
#endif
#if (CY_PERI_GROUP_NR > 14)
    _CYHAL_CLOCK_CREATE(PERI, 14),
#endif
#if (CY_PERI_GROUP_NR > 15)
    _CYHAL_CLOCK_CREATE(PERI, 15),
#endif
};

#if (SRSS_NUM_PLL200M > 0)
#if defined(COMPONENT_CAT1B)
const cyhal_clock_t CYHAL_CLOCK_PLL[SRSS_NUM_PLL200M] =
{
#else
const cyhal_clock_t CYHAL_CLOCK_PLL200[SRSS_NUM_PLL200M] =
{
#endif
    _CYHAL_CLOCK_CREATE(PLL200, 0),
#if (SRSS_NUM_PLL200M > 1)
    _CYHAL_CLOCK_CREATE(PLL200, 1),
#endif
#if (SRSS_NUM_PLL200M > 2)
    _CYHAL_CLOCK_CREATE(PLL200, 2),
#endif
#if (SRSS_NUM_PLL200M > 3)
    _CYHAL_CLOCK_CREATE(PLL200, 3),
#endif
#if (SRSS_NUM_PLL200M > 4)
    _CYHAL_CLOCK_CREATE(PLL200, 4),
#endif
#if (SRSS_NUM_PLL200M > 5)
    _CYHAL_CLOCK_CREATE(PLL200, 5),
#endif
#if (SRSS_NUM_PLL200M > 6)
    _CYHAL_CLOCK_CREATE(PLL200, 6),
#endif
#if (SRSS_NUM_PLL200M > 7)
    _CYHAL_CLOCK_CREATE(PLL200, 7),
#endif
#if (SRSS_NUM_PLL200M > 8)
    _CYHAL_CLOCK_CREATE(PLL200, 8),
#endif
#if (SRSS_NUM_PLL200M > 9)
    _CYHAL_CLOCK_CREATE(PLL200, 9),
#endif
#if (SRSS_NUM_PLL200M > 10)
    _CYHAL_CLOCK_CREATE(PLL200, 10),
#endif
#if (SRSS_NUM_PLL200M > 11)
    _CYHAL_CLOCK_CREATE(PLL200, 11),
#endif
#if (SRSS_NUM_PLL200M > 12)
    _CYHAL_CLOCK_CREATE(PLL200, 12),
#endif
#if (SRSS_NUM_PLL200M > 13)
    _CYHAL_CLOCK_CREATE(PLL200, 13),
#endif
#if (SRSS_NUM_PLL200M > 14)
    _CYHAL_CLOCK_CREATE(PLL200, 14),
#endif
};
#endif

#if (SRSS_NUM_PLL400M > 0)
#if defined(COMPONENT_CAT1B)
const cyhal_clock_t CYHAL_CLOCK_PLL[SRSS_NUM_PLL400M] =
{
#else
const cyhal_clock_t CYHAL_CLOCK_PLL400[SRSS_NUM_PLL400M] =
{
#endif
    _CYHAL_CLOCK_CREATE(PLL400, 0),
#if (SRSS_NUM_PLL400M > 1)
    _CYHAL_CLOCK_CREATE(PLL400, 1),
#endif
#if (SRSS_NUM_PLL400M > 2)
    _CYHAL_CLOCK_CREATE(PLL400, 2),
#endif
#if (SRSS_NUM_PLL400M > 3)
    _CYHAL_CLOCK_CREATE(PLL400, 3),
#endif
#if (SRSS_NUM_PLL400M > 4)
    _CYHAL_CLOCK_CREATE(PLL400, 4),
#endif
#if (SRSS_NUM_PLL400M > 5)
    _CYHAL_CLOCK_CREATE(PLL400, 5),
#endif
#if (SRSS_NUM_PLL400M > 6)
    _CYHAL_CLOCK_CREATE(PLL400, 6),
#endif
#if (SRSS_NUM_PLL400M > 7)
    _CYHAL_CLOCK_CREATE(PLL400, 7),
#endif
#if (SRSS_NUM_PLL400M > 8)
    _CYHAL_CLOCK_CREATE(PLL400, 8),
#endif
#if (SRSS_NUM_PLL400M > 9)
    _CYHAL_CLOCK_CREATE(PLL400, 9),
#endif
#if (SRSS_NUM_PLL400M > 10)
    _CYHAL_CLOCK_CREATE(PLL400, 10),
#endif
#if (SRSS_NUM_PLL400M > 11)
    _CYHAL_CLOCK_CREATE(PLL400, 11),
#endif
#if (SRSS_NUM_PLL400M > 12)
    _CYHAL_CLOCK_CREATE(PLL400, 12),
#endif
#if (SRSS_NUM_PLL400M > 13)
    _CYHAL_CLOCK_CREATE(PLL400, 13),
#endif
#if (SRSS_NUM_PLL400M > 14)
    _CYHAL_CLOCK_CREATE(PLL400, 14),
#endif
};
#endif
#endif



/******************************************************************************
 **************************** Public API (clocks) *****************************
 *****************************************************************************/

cy_rslt_t _cyhal_clock_allocate_channel(cyhal_clock_t *clock, cyhal_clock_block_t block, const void* funcs)
{
    uint8_t maxChannels = (uint8_t)_cyhal_utils_get_clock_count(block);
    for (uint8_t i = 0; i < maxChannels; i++)
    {
        cyhal_resource_inst_t clock_resource = { CYHAL_RSC_CLOCK, block, i };
        if (CY_RSLT_SUCCESS == cyhal_hwmgr_reserve(&clock_resource))
        {
            clock->block = block;
            clock->channel = i;
            clock->reserved = true;
            clock->funcs = funcs;
            return CY_RSLT_SUCCESS;
        }
    }
    return CYHAL_HWMGR_RSLT_ERR_NONE_FREE;
}

