RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_clock.c
cy_rslt_t cyhal_clock_get(cyhal_clock_t *clock, const cyhal_resource_inst_t *resource)
{
    CY_ASSERT(NULL != clock);
    CY_ASSERT(NULL != resource);
    CY_ASSERT(CYHAL_RSC_CLOCK == resource->type);

    clock->block = (cyhal_clock_block_t)resource->block_num;
    clock->channel = resource->channel_num;
    clock->reserved = false;
    clock->funcs = _cyhal_clock_get_funcs_all((cyhal_clock_block_t)resource->block_num);

    return CY_RSLT_SUCCESS;
}

cy_rslt_t cyhal_clock_reserve(cyhal_clock_t *clock, const cyhal_clock_t *clock_)
{
    CY_ASSERT(NULL != clock);
    CY_ASSERT(NULL != clock_);

    cyhal_resource_inst_t clock_resource = { CYHAL_RSC_CLOCK, clock_->block, clock_->channel };
    cy_rslt_t rslt = cyhal_hwmgr_reserve(&clock_resource);
    if (CY_RSLT_SUCCESS == rslt)
    {
        memcpy(clock, clock_, sizeof(cyhal_clock_t));
        clock->reserved = true;
    }
    return rslt;
}

cyhal_clock_feature_t cyhal_clock_get_features(const cyhal_clock_t *clock)
{
    CY_ASSERT(NULL != clock);

    if (clock->block == CYHAL_CLOCK_BLOCK_HF)
    {
        return (clock->channel == 0)    // HF0 cannot be disabled
            ? (cyhal_clock_feature_t)(CYHAL_CLOCK_FEATURE_SOURCE | CYHAL_CLOCK_FEATURE_DIVIDER)
            : (cyhal_clock_feature_t)(CYHAL_CLOCK_FEATURE_ENABLE | CYHAL_CLOCK_FEATURE_SOURCE | CYHAL_CLOCK_FEATURE_DIVIDER);
    }
    else if (clock->block < 4 * _CYHAL_CLOCK_PERI_GROUPS)
        return (cyhal_clock_feature_t)(CYHAL_CLOCK_FEATURE_ENABLE | CYHAL_CLOCK_FEATURE_DIVIDER | CYHAL_CLOCK_FEATURE_FREQUENCY);
    else
        return ((cyhal_clock_funcs_t*)clock->funcs)->features;
}

bool cyhal_clock_is_enabled(const cyhal_clock_t *clock)
{
    CY_ASSERT(NULL != clock);

    if (clock->block == CYHAL_CLOCK_BLOCK_HF)
        return _cyhal_clock_is_enabled_hf(clock);
    else if (clock->block < 4 * _CYHAL_CLOCK_PERI_GROUPS)
        return _cyhal_clock_is_enabled_peripheral(clock);
    else
        return ((cyhal_clock_funcs_t*)clock->funcs)->is_enabled(clock);
}

cy_rslt_t cyhal_clock_set_enabled(cyhal_clock_t *clock, bool enabled, bool wait_for_lock)
{
    CY_ASSERT(NULL != clock);

    if (clock->block == CYHAL_CLOCK_BLOCK_HF)
        return _cyhal_clock_set_enabled_hf(clock, enabled, wait_for_lock);
    else if (clock->block < 4 * _CYHAL_CLOCK_PERI_GROUPS)
        return _cyhal_clock_set_enabled_peripheral(clock, enabled, wait_for_lock);
    else
        return ((cyhal_clock_funcs_t*)clock->funcs)->set_enabled(clock, enabled, wait_for_lock);
}

uint32_t cyhal_clock_get_frequency(const cyhal_clock_t *clock)
{
    CY_ASSERT(NULL != clock);

    if (cyhal_clock_is_enabled(clock))
    {
        if (clock->block == CYHAL_CLOCK_BLOCK_HF)
            return _cyhal_clock_get_frequency_hf(clock);
        else if (clock->block < 4 * _CYHAL_CLOCK_PERI_GROUPS)
            return _cyhal_clock_get_frequency_peripheral(clock);
        else
            return ((cyhal_clock_funcs_t*)clock->funcs)->get_frequency(clock);
    }
    return 0;
}

cy_rslt_t cyhal_clock_set_frequency(cyhal_clock_t *clock, uint32_t hz, const cyhal_clock_tolerance_t *tolerance)
{
    CY_ASSERT(NULL != clock);

    if (clock->block == CYHAL_CLOCK_BLOCK_HF)
        return _cyhal_clock_set_frequency_unsupported(clock, hz, tolerance);
    else if (clock->block < 4 * _CYHAL_CLOCK_PERI_GROUPS)
        return _cyhal_clock_set_frequency_peripheral(clock, hz, tolerance);
    else
        return ((cyhal_clock_funcs_t*)clock->funcs)->set_frequency(clock, hz, tolerance);
}

cy_rslt_t cyhal_clock_set_divider(cyhal_clock_t *clock, uint32_t divider)
{
    CY_ASSERT(NULL != clock);

    if (clock->block == CYHAL_CLOCK_BLOCK_HF)
        return _cyhal_clock_set_divider_hf(clock, divider);
    else if (clock->block < 4 * _CYHAL_CLOCK_PERI_GROUPS)
        return _cyhal_clock_set_divider_peripheral(clock, divider);
    else
        return ((cyhal_clock_funcs_t*)clock->funcs)->set_divider(clock, divider);
}

cy_rslt_t cyhal_clock_get_sources(const cyhal_clock_t *clock, const cyhal_resource_inst_t **sources[], uint32_t *count)
{
    CY_ASSERT(NULL != clock);

    if (clock->block == CYHAL_CLOCK_BLOCK_HF)
        return _cyhal_clock_get_sources_hf(clock, sources, count);
    else if (clock->block < 4 * _CYHAL_CLOCK_PERI_GROUPS)
        return _cyhal_clock_get_sources_peripheral(clock, sources, count);
    else
        return ((cyhal_clock_funcs_t*)clock->funcs)->get_sources(clock, sources, count);
}

cy_rslt_t cyhal_clock_set_source(cyhal_clock_t *clock, const cyhal_clock_t *source)
{
    CY_ASSERT(NULL != clock && NULL != source);

    if (clock->block == CYHAL_CLOCK_BLOCK_HF)
        return _cyhal_clock_set_source_hf(clock, source);
    else if (clock->block < 4 * _CYHAL_CLOCK_PERI_GROUPS)
        return _cyhal_clock_set_source_unsupported(clock, source);
    else
        return ((cyhal_clock_funcs_t*)clock->funcs)->set_source(clock, source);
}

void cyhal_clock_free(cyhal_clock_t *clock)
{
    CY_ASSERT(NULL != clock);
    CY_ASSERT(clock->reserved);

    cyhal_resource_inst_t rsc = { CYHAL_RSC_CLOCK, clock->block, clock->channel };
    cyhal_hwmgr_free(&rsc);
    clock->reserved = false;
}

#if defined(__cplusplus)
}
#endif

#endif // CYHAL_DRIVER_AVAILABLE_CLOCK
